eecs440.org
#+TITLE: EECS 440 Notes
#+AUTHOR: Stephen Brennan
#+SETUPFILE: config.setup

* 2015-09-29 Tuesday

** Support Vector Machines

   - SVM's are a rather new method in machine learning.
   - Produced by multiple groups of people in ML, Statistics, and Operations
     Research who basically converged on this idea.
   - Three fundamental ideas:
     - Linear discriminants (we saw this with a perceptron)
     - Margins
     - Kernels

*** Linear Discriminants

    What is?
    - \(sign(5x_1 + 3x_2 - 4)\)
    - \(sign(x_2 - 4x_1^2)\)
    - \(sign(x_2 - e^{-x^2})\)

    This was a trick question.  They all are.  In machine learning, we aren't
    particularly interested in the $x$ variables -- they are given to us.  We are
    interested in the coefficients $w$.  So when we talk about linear
    discriminants, we mean linear in terms of $w$, not $x$.
    - In general, we talk about a linear discriminant in this form:
    - \(\vec{w} \cdot \phi(\vec{x}) + b = 0\)

    When we talked about perceptrons not being able to discriminate XOR, it was
    not entirely true.  If you make a transformation $\phi$ of the variables, you
    can define a line that discriminates XOR perfectly.  This transformation is
    \(\phi(x_1, x_2) = x_1 + x_1 x_2 \).  You can see the diagram in the slides.

*** Margins

    Given a training sample, you can frequently define tons of linear
    discriminants that cleanly separate the training sample.

    What is the best one?  Probably the one that is mostly in the middle of the
    training positives and negatives.

    We define *margins* as the amount you could slide the discriminant in until
    you reach a point.  With this, we can say that we would define our best SVM
    classifier as the one with the /maximum margin/.

    When you are in the "/input feature space/", (i.e. \(\phi(\vec{x})=\vec{x}\)),
    this is called a "linear SVM" (which is a bit confusing, but this means
    linear in the feature space, as opposed to the coefficient space -- in
    essence, it's a linear, linear SVM).

** Why it makes sense

   - Computationally easy to come up with.
   - Requires relatively few data points.

