eecs440.org
** Calculating the Margin

   If you have a classifier \(\vec{w}\cdot\vec{x} + b = 0\), and your first positive
   datapoint is at \(\vec{w}\cdot\vec{x} + b = 1\), and your first negative point is
   \(\vec{w}\cdot\vec{x} + b = -1\).  Cool.

   Note that $\vec{w}$ is perpendicular to \(\vec{w}\cdot\vec{x} + b = 0\),
   - Why? Pick any $\vec{u}$, $\vec{v}$.
   - \(\vec{w}\cdot(\vec{u}-\vec{v}) = \vec{w}\cdot\vec{u} - \vec{w}\cdot\vec{v} = (-b) -
     (-b) = 0\)
   - Also, $\vec{w}$ is perpendicular to the plus and minus planes.

   There's some stuff here that I didn't follow.  Essentially, he got to the
   point where maximizing the margin is equivalent to maximizing
   \(\frac{2}{||\vec{w}||}\), which is equivalent to $\frac{||\vec{w}||^2}{2}$.

** Problem Formulation

   What we want to do:
   - While respecting the labels of training examples:
     - \(\vec{w}\cdot\vec{x_i} + b \ge 1 \text{ if } y_i = 1\)
     - \(\vec{w}\cdot\vec{x_i} + b \le -1 \text{ if } y_i = -1\)
   - Or, more compactly:
     - \(y_i(\vec{w}\cdot\vec{x_i} + b) \ge 1\)

   Problem formulation:
   - \(\min \frac{1}{2} ||\vec{w}||^2\), s.t.
   - \(y_i(\vec{w}\cdot\vec{x}_i + b) \ge 1\)

   Whoa, it's quadratic programming!  There are algorithms to do this, and since
   the constraints are linear, the feasible region is convex, and therefore we
   have a global minimum!

   Unfortunately, if the data are not linearly separable, then our quadratic
   programming algorithm will come back saying that the problem is not feasible.
   So, we need to allow for misclassification by adding slack variables:

   - \(\min \frac{1}{2} ||\vec{w}||^2\), s.t.
   - \(y_i(\vec{w}\cdot\vec{x}_i + b) + \xi_i \ge 1\)
   - \(\xi_i \ge 0\)

   Sadly, this doesn't solve the problem.  A trivial solution that always
   exists: \(\vec{w}=\vec{0}\), and \(\xi_i=0\)!  We need to add into the objective
   function a term to simultaneously minimize the number of errors in the
   classifier.  Unfortunately, the number of errors is not a differentiable
   quantity, but \(\sum_i \xi_i\) is a good proxy and is differentiable.  Hooray!

   - \(\min \frac{1}{2} ||\vec{w}||^2 + C\sum_i \xi_i \), s.t.
   - \(y_i(\vec{w}\cdot\vec{x}_i + b) + \xi_i \ge 1\)
   - \(\xi_i \ge 0\)

   In this program, $C$ is a constant that quantifies the "tradeoff" between the
   generalization and the error.  The value tends to be problem and dataset
   specific, so you need to determine it via cross validation in your code.

   Notice that in an optimal solution \(\xi_i = \max(0,1-y_i(\vec{w}\cdot\vec{x}_i +
   b))\).  We can lift this into the objective function to remove the
   constraints:

   \begin{equation}
     \min \frac{1}{2} ||\vec{w}||^2 + C\sum_i [(1 - y_i(\vec{w}\cdot\vec{x}_i + b))]^2
   \end{equation}

   We don't need to use quadratic programming now, we can just solve an
   unconstrained problem, which is much simpler and more efficient.  Yay us.

** Course Project Notes

   Sign up sheet: "I want to do project", "I have an idea for a project."

   Email with idea for project by 10/9.  Official project start date 10/23.

   Significant work - treat like a real research project.  Start with a
   hypothesis of what you'd like to show.  You may be algorithm-specific, or
   application specific:
   - I have a better version of algorithm X.
   - My algorithm X is better for application Y.

   Preferably, you should integrate the project with your own research.  You may
   also be able to integrate the project with other course projects as well.

   In terms of grading, the project is 35% of your grade:
   - 25% is a writeup, in a conference format, of your problem, experiments,
     observations, and interesting directions.
   - 10% is a presentation to the class on what you did, during finals week.

   Website will have example projects, and a document with requirements for the
   writeup document.

   *The writeup is due Dec 10!  /No extensions!!/*

* 2015-09-24 Thursday

  Recall: we want to compare ML algorithms.  Our steps for comparing test data:
  1. Determine the sampling distribution.
  2. Estimate parameters using MLE.
  3. Use an approximation distribution if necessary.
  4. Come up with a C% confidence interval.

  Our "Issue #1" was "what do we know about the true performance of a
  classification algorithm, given that we've tested it on a test set?"
  - We determined that we could come up with a confidence interval for an
    observed test statistic.

** Issue 2.1

  Our next issue, #2.1, is that we have a conjecture "classifier A is better
  than algorithm B on a certain type of data."  We would like to evaluate
  whether this conjecture is true.  We can do this with statistical hypothesis
  testing.

  We want to look at the random variable \(F = Err_{C_1} - Err_{C_2}\).  What can we
  say about the sampling distribution of $F$?  Assuming that the error
  distributions are Gaussian, the distribution of $F$ is going to be Gaussian
  also.  The MLE parameter estimates:
  - \(E(F) = e_{S,C_1} - e_{S,C_2} = \left(\frac{r_1}{n_1} - \frac{r_2}{n_2}\right)\)
  - \(V(F) = V(Err_{C_1}) + V(Err_{C_2}) = \frac{e_{S,C_1}(1-e_{S,C_1})}{n_1} + \frac{e_{S,C_2}(1-e_{S,C_2})}{n_2}\)

  Comparing classifiers: hypothesis testing:
  - Establish your "null hypothesis."
    - You will reject this hypothesis with high probability.
    - You presume it is true until the test shows otherwise.

  This test assumes that the two classifiers were evaluated on independent test
  data.

  Example:
  - On a test set with (*0 examples a decision tree misclassifies 20 examples.
    on the same test set, a neural network misclassifies 25 examples. Are these
    two classifiers actually different on this problem?
  - \(F=\frac{r_1}{n_1} - \frac{r_2}{n_2} = 0.05\)
  - \(V(F) = 0.2(1-0.2)/100 + 0.25 (1-0.25) / 100 = 0.0016 + 0.001875 = 0.0034\)
  - Standard deviation is about 0.05.
  - 0 is definitely within the 95% confidence interval, so we cannot reject the
    null hypothesis (that they are the same)

