eecs440.html

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">2.3</span> Calculating the Margin</h3>
<div class="outline-text-3" id="text-2-3">
<p>
If you have a classifier \(\vec{w}\cdot\vec{x} + b = 0\), and your first positive
datapoint is at \(\vec{w}\cdot\vec{x} + b = 1\), and your first negative point is
\(\vec{w}\cdot\vec{x} + b = -1\).  Cool.
</p>

<p>
Note that \(\vec{w}\) is perpendicular to \(\vec{w}\cdot\vec{x} + b = 0\),
</p>
<ul class="org-ul">
<li>Why? Pick any \(\vec{u}\), \(\vec{v}\).</li>
<li>\(\vec{w}\cdot(\vec{u}-\vec{v}) = \vec{w}\cdot\vec{u} - \vec{w}\cdot\vec{v} = (-b) -
     (-b) = 0\)</li>
<li>Also, \(\vec{w}\) is perpendicular to the plus and minus planes.</li>
</ul>

<p>
There's some stuff here that I didn't follow.  Essentially, he got to the
point where maximizing the margin is equivalent to maximizing
\(\frac{2}{||\vec{w}||}\), which is equivalent to \(\frac{||\vec{w}||^2}{2}\).
</p>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">2.4</span> Problem Formulation</h3>
<div class="outline-text-3" id="text-2-4">
<p>
What we want to do:
</p>
<ul class="org-ul">
<li>While respecting the labels of training examples:
<ul class="org-ul">
<li>\(\vec{w}\cdot\vec{x_i} + b \ge 1 \text{ if } y_i = 1\)</li>
<li>\(\vec{w}\cdot\vec{x_i} + b \le -1 \text{ if } y_i = -1\)</li>
</ul></li>
<li>Or, more compactly:
<ul class="org-ul">
<li>\(y_i(\vec{w}\cdot\vec{x_i} + b) \ge 1\)</li>
</ul></li>
</ul>

<p>
Problem formulation:
</p>
<ul class="org-ul">
<li>\(\min \frac{1}{2} ||\vec{w}||^2\), s.t.</li>
<li>\(y_i(\vec{w}\cdot\vec{x}_i + b) \ge 1\)</li>
</ul>

<p>
Whoa, it's quadratic programming!  There are algorithms to do this, and since
the constraints are linear, the feasible region is convex, and therefore we
have a global minimum!
</p>

<p>
Unfortunately, if the data are not linearly separable, then our quadratic
programming algorithm will come back saying that the problem is not feasible.
So, we need to allow for misclassification by adding slack variables:
</p>

<ul class="org-ul">
<li>\(\min \frac{1}{2} ||\vec{w}||^2\), s.t.</li>
<li>\(y_i(\vec{w}\cdot\vec{x}_i + b) + \xi_i \ge 1\)</li>
<li>\(\xi_i \ge 0\)</li>
</ul>

<p>
Sadly, this doesn't solve the problem.  A trivial solution that always
exists: \(\vec{w}=\vec{0}\), and \(\xi_i=0\)!  We need to add into the objective
function a term to simultaneously minimize the number of errors in the
classifier.  Unfortunately, the number of errors is not a differentiable
quantity, but \(\sum_i \xi_i\) is a good proxy and is differentiable.  Hooray!
</p>

<ul class="org-ul">
<li>\(\min \frac{1}{2} ||\vec{w}||^2 + C\sum_i \xi_i \), s.t.</li>
<li>\(y_i(\vec{w}\cdot\vec{x}_i + b) + \xi_i \ge 1\)</li>
<li>\(\xi_i \ge 0\)</li>
</ul>

<p>
In this program, \(C\) is a constant that quantifies the "tradeoff" between the
generalization and the error.  The value tends to be problem and dataset
specific, so you need to determine it via cross validation in your code.
</p>

<p>
Notice that in an optimal solution \(\xi_i = \max(0,1-y_i(\vec{w}\cdot\vec{x}_i +
   b))\).  We can lift this into the objective function to remove the
constraints:
</p>

\begin{equation}
  \min \frac{1}{2} ||\vec{w}||^2 + C\sum_i [(1 - y_i(\vec{w}\cdot\vec{x}_i + b))]^2
\end{equation}

<p>
We don't need to use quadratic programming now, we can just solve an
unconstrained problem, which is much simpler and more efficient.  Yay us.
</p>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">2.5</span> Course Project Notes</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Sign up sheet: "I want to do project", "I have an idea for a project."
</p>

<p>
Email with idea for project by 10/9.  Official project start date 10/23.
</p>

<p>
Significant work - treat like a real research project.  Start with a
hypothesis of what you'd like to show.  You may be algorithm-specific, or
application specific:
</p>
<ul class="org-ul">
<li>I have a better version of algorithm X.</li>
<li>My algorithm X is better for application Y.</li>
</ul>

<p>
Preferably, you should integrate the project with your own research.  You may
also be able to integrate the project with other course projects as well.
</p>

<p>
In terms of grading, the project is 35% of your grade:
</p>
<ul class="org-ul">
<li>25% is a writeup, in a conference format, of your problem, experiments,
observations, and interesting directions.</li>
<li>10% is a presentation to the class on what you did, during finals week.</li>
</ul>

<p>
Website will have example projects, and a document with requirements for the
writeup document.
</p>

<p>
<b>The writeup is due Dec 10!  <i>No extensions!!</i></b>
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-2">
<h2 id="orgheadline20"><span class="section-number-2">3</span> 2015-09-24 Thursday</h2>
<div class="outline-text-2" id="text-3">
<p>
Recall: we want to compare ML algorithms.  Our steps for comparing test data:
</p>
<ol class="org-ol">
<li>Determine the sampling distribution.</li>
<li>Estimate parameters using MLE.</li>
<li>Use an approximation distribution if necessary.</li>
<li>Come up with a C% confidence interval.</li>
</ol>

<p>
Our "Issue #1" was "what do we know about the true performance of a
classification algorithm, given that we've tested it on a test set?"
</p>
<ul class="org-ul">
<li>We determined that we could come up with a confidence interval for an
observed test statistic.</li>
</ul>
</div>

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">3.1</span> Issue 2.1</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Our next issue, #2.1, is that we have a conjecture "classifier A is better
than algorithm B on a certain type of data."  We would like to evaluate
whether this conjecture is true.  We can do this with statistical hypothesis
testing.
</p>

<p>
We want to look at the random variable \(F = Err_{C_1} - Err_{C_2}\).  What can we
say about the sampling distribution of \(F\)?  Assuming that the error
distributions are Gaussian, the distribution of \(F\) is going to be Gaussian
also.  The MLE parameter estimates:
</p>
<ul class="org-ul">
<li>\(E(F) = e_{S,C_1} - e_{S,C_2} = \left(\frac{r_1}{n_1} - \frac{r_2}{n_2}\right)\)</li>
<li>\(V(F) = V(Err_{C_1}) + V(Err_{C_2}) = \frac{e_{S,C_1}(1-e_{S,C_1})}{n_1} + \frac{e_{S,C_2}(1-e_{S,C_2})}{n_2}\)</li>
</ul>

<p>
Comparing classifiers: hypothesis testing:
</p>
<ul class="org-ul">
<li>Establish your "null hypothesis."
<ul class="org-ul">
<li>You will reject this hypothesis with high probability.</li>
<li>You presume it is true until the test shows otherwise.</li>
</ul></li>
</ul>

<p>
This test assumes that the two classifiers were evaluated on independent test
data.
</p>

<p>
Example:
</p>
<ul class="org-ul">
<li>On a test set with (*0 examples a decision tree misclassifies 20 examples.
on the same test set, a neural network misclassifies 25 examples. Are these
two classifiers actually different on this problem?</li>
<li>\(F=\frac{r_1}{n_1} - \frac{r_2}{n_2} = 0.05\)</li>
<li>\(V(F) = 0.2(1-0.2)/100 + 0.25 (1-0.25) / 100 = 0.0016 + 0.001875 = 0.0034\)</li>
<li>Standard deviation is about 0.05.</li>
<li>0 is definitely within the 95% confidence interval, so we cannot reject the
null hypothesis (that they are the same)</li>
</ul>
</div>
</div>
