eecs440.org
** Issue 2.2

   This issue is critically different from 2.1.  In 2.1, we had two classifiers
   -- who knows where they came from, but we want to compare those two
   classifiers' performances.  In this case, we have two learning algorithms,
   and we want to compare the performance of the *algorithms*, not a particular
   *classifier* produced by an algorithm.

   In order to do so, we must find the expected value of an algorithm's error
   rate.  To do this, we must take the average over all classifiers, produced by
   all possible training sets.  We usually estimate this by doing $n$-fold
   validation instead of actually finding all possible training sets from the
   population.

   We can do /pair testing/, where we evaluate the algorithms on the same folds,
   and then compare the difference between their error rates.  Or, we can do it
   independently, on separate folds, and compare their error rates.  But this
   method gives you a bigger variance.

   When you compare the difference of error rates, you want to know what the
   sampling distribution is.  The sampling distribution looks Gaussian, but not
   quite.  Instead, it's a $t$ distribution.  If $k$ (the number of folds) was
   very large, we could use the Gaussian, but instead we have to use $t$
   distribution, with $k-1$ degrees of freedom.  Here are parameter estimates:
   - Mean (\delta): the average difference of error rates across $k$ folds.
   - Standard Deviation:
     \begin{equation}
       s = \sqrt{\frac{\sum_{i=1}^k (\delta_i - \delta)^2}{k(k-1)}}
     \end{equation}
   - The standard deviation is adjusted to make the distribution narrower, and
     put more mass in the tails!

** One-way ANOVA

   - For comparing >2 algorithms.
   - Why not just do pairwise hypothesis tests?
     - The results may not be consistent (i.e. transitive)
     - Multiple hypotheses result in lost confidence, so you'd need to correct
       your P-value/confidence interval.
       - EG: with 10 95% CI's, you only have 60% confidence that the true values
         of all 10 parameters are within the range.
   - ANOVA looks at the "between means" variance.
   - Essentially, it seems like a generalized $t$ test (gives the same result as
     a $t$ test for two distributions).

** Sign Test

   - Simpler than $t$ test with fewer assumptions.
   - For each fold, note which algorithm had better performance.
   - Use binomial null hypothesis, where p=0.5.

** Mann-Whitney-Wolcoxon Signed-Rank Test

   - What if a classifier produces confidence estimates?
   - If we can rank the predictions, we can calculate a $U$ statistic based on
     the ranks:
     \begin{equation}
       U_1 = \sum_i R_{1,i} - \frac{n_1(n_1 + 1)}{2}
     \end{equation}
   - For large enough samples, you can approximate $U$ with a normal
     distribution.
   - AUC is actually a normalized version of $U$!

** Bootstrap

   - All previous methods relied on knowing the sampling distribution of the
     statistic we are interested in.
   - The bootstrap is a procedure where we get the properties of the statistic
     using /empirical resampling/ from the observations.

   Example:
   - Suppose we have a set of iid examples and we want to get a C1 for F1 score.
   - Repeatedly draw an equal sized sample (with replacement) from our test
     examples, and measure F1.
   - This creates an empirical sampling dsitribution.
   - Then, go back to the original data, measure F1, and ask how unusual that is
     in the empirical distribution.

   Weird... ¯\_ (ツ)_/¯

   Pros: very easy, few assumptions, good for complex things.

   Cons: finite sample behavior is not very well understood.

** Is there a best learning algorithm?

   - No
   - No Free Lunch theorem!
     - In the expectation over all learning algorithms, they will perform
       equally.
     - Wolpert 1996: "The lack of a priori distinctions between learning
       algorithms."
     - For any specific application, you can have a "best" algorithm.  But
       overall, no.

* 2015-09-22 Tuesday

** ANNs, Continued

*** Cascade Correlation (Learning the Structure of an ANN)

    - No textbook sections on this, ask for paper.
    - Start with a single perceptron.  Train and find "residuals".
    - Now, add a new perceptron that feeds into the original one.
    - Train it to feed the "residuals" into the original perceptron.
      - Hold the original perceptron's training constant.
    - Continue adding perceptrons that correct for the "residual" of the
      previous iteration.
    - This essentially does a Taylor series approximation of the underlying
      function.
    - It is an instantiation of a more general technique called "gradient
      boosting".

*** Interpretation of Hidden Units

    - Unlike Decision trees, the ANN structure is very opaque.
    - Difficult to interpret what it is doing.
    - One way is to look at the last layer of the ANN (the last perceptron) and
      see what it's doing.  You could even assign labels to each of the inputs
      for whatever concept you may believe they represent.

*** How Many Hidden Units?

    - Some work shows that it is better to start with a network that is too big.
      - Train until the error on the validation set grows.
      - Then look at the weights associated with edges, and prune the hidden
        units that don't actually contribute.

*** Recurrent ANNs

    - So far, we've looked at ANNs that feed forward.
    - There are also networks with loops, called "recurrent neural networks"
      - This gives ANNs a "memory" of previous inputs.
      - They are much more of a dynamic structure
    - A recurrent ANN architecture with /rational weights/ has computational
      power equivalent to a Universal Turing Machine!!!!!
      - However, this is ridiculously hard to train (ya don't say...)
      - Very prone to overfitting.

*** Pros/Cons of ANNs

    Pros:
    - Very expressive hypothesis space
    - Very useful for classification, regression, density estimation
    - Builds useful representations "automatically"

    Cons:
    - Easy to overfit.
    - Slow to train, require many examples.
    - Doesn't easily handle nominal data.
    - Opaque

** Comparing Learning Algorithms

