eecs440.html

<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">3.2</span> Issue 2.2</h3>
<div class="outline-text-3" id="text-3-2">
<p>
This issue is critically different from 2.1.  In 2.1, we had two classifiers
&#x2013; who knows where they came from, but we want to compare those two
classifiers' performances.  In this case, we have two learning algorithms,
and we want to compare the performance of the <b>algorithms</b>, not a particular
<b>classifier</b> produced by an algorithm.
</p>

<p>
In order to do so, we must find the expected value of an algorithm's error
rate.  To do this, we must take the average over all classifiers, produced by
all possible training sets.  We usually estimate this by doing $n$-fold
validation instead of actually finding all possible training sets from the
population.
</p>

<p>
We can do <i>pair testing</i>, where we evaluate the algorithms on the same folds,
and then compare the difference between their error rates.  Or, we can do it
independently, on separate folds, and compare their error rates.  But this
method gives you a bigger variance.
</p>

<p>
When you compare the difference of error rates, you want to know what the
sampling distribution is.  The sampling distribution looks Gaussian, but not
quite.  Instead, it's a \(t\) distribution.  If \(k\) (the number of folds) was
very large, we could use the Gaussian, but instead we have to use \(t\)
distribution, with \(k-1\) degrees of freedom.  Here are parameter estimates:
</p>
<ul class="org-ul">
<li>Mean (&delta;): the average difference of error rates across \(k\) folds.</li>
<li><p>
Standard Deviation:
</p>
\begin{equation}
  s = \sqrt{\frac{\sum_{i=1}^k (\delta_i - \delta)^2}{k(k-1)}}
\end{equation}</li>
<li>The standard deviation is adjusted to make the distribution narrower, and
put more mass in the tails!</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">3.3</span> One-way ANOVA</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>For comparing &gt;2 algorithms.</li>
<li>Why not just do pairwise hypothesis tests?
<ul class="org-ul">
<li>The results may not be consistent (i.e. transitive)</li>
<li>Multiple hypotheses result in lost confidence, so you'd need to correct
your P-value/confidence interval.
<ul class="org-ul">
<li>EG: with 10 95% CI's, you only have 60% confidence that the true values
of all 10 parameters are within the range.</li>
</ul></li>
</ul></li>
<li>ANOVA looks at the "between means" variance.</li>
<li>Essentially, it seems like a generalized \(t\) test (gives the same result as
a \(t\) test for two distributions).</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">3.4</span> Sign Test</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>Simpler than \(t\) test with fewer assumptions.</li>
<li>For each fold, note which algorithm had better performance.</li>
<li>Use binomial null hypothesis, where p=0.5.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">3.5</span> Mann-Whitney-Wolcoxon Signed-Rank Test</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>What if a classifier produces confidence estimates?</li>
<li><p>
If we can rank the predictions, we can calculate a \(U\) statistic based on
the ranks:
</p>
\begin{equation}
  U_1 = \sum_i R_{1,i} - \frac{n_1(n_1 + 1)}{2}
\end{equation}</li>
<li>For large enough samples, you can approximate \(U\) with a normal
distribution.</li>
<li>AUC is actually a normalized version of \(U\)!</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">3.6</span> Bootstrap</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li>All previous methods relied on knowing the sampling distribution of the
statistic we are interested in.</li>
<li>The bootstrap is a procedure where we get the properties of the statistic
using <i>empirical resampling</i> from the observations.</li>
</ul>

<p>
Example:
</p>
<ul class="org-ul">
<li>Suppose we have a set of iid examples and we want to get a C1 for F1 score.</li>
<li>Repeatedly draw an equal sized sample (with replacement) from our test
examples, and measure F1.</li>
<li>This creates an empirical sampling dsitribution.</li>
<li>Then, go back to the original data, measure F1, and ask how unusual that is
in the empirical distribution.</li>
</ul>

<p>
Weird&#x2026; ¯&ensp;(ツ)_/¯
</p>

<p>
Pros: very easy, few assumptions, good for complex things.
</p>

<p>
Cons: finite sample behavior is not very well understood.
</p>
</div>
</div>

<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">3.7</span> Is there a best learning algorithm?</h3>
<div class="outline-text-3" id="text-3-7">
<ul class="org-ul">
<li>No</li>
<li>No Free Lunch theorem!
<ul class="org-ul">
<li>In the expectation over all learning algorithms, they will perform
equally.</li>
<li>Wolpert 1996: "The lack of a priori distinctions between learning
algorithms."</li>
<li>For any specific application, you can have a "best" algorithm.  But
overall, no.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline31" class="outline-2">
<h2 id="orgheadline31"><span class="section-number-2">4</span> 2015-09-22 Tuesday</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline26" class="outline-3">
<h3 id="orgheadline26"><span class="section-number-3">4.1</span> ANNs, Continued</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21"><span class="section-number-4">4.1.1</span> Cascade Correlation (Learning the Structure of an ANN)</h4>
<div class="outline-text-4" id="text-4-1-1">
<ul class="org-ul">
<li>No textbook sections on this, ask for paper.</li>
<li>Start with a single perceptron.  Train and find "residuals".</li>
<li>Now, add a new perceptron that feeds into the original one.</li>
<li>Train it to feed the "residuals" into the original perceptron.
<ul class="org-ul">
<li>Hold the original perceptron's training constant.</li>
</ul></li>
<li>Continue adding perceptrons that correct for the "residual" of the
previous iteration.</li>
<li>This essentially does a Taylor series approximation of the underlying
function.</li>
<li>It is an instantiation of a more general technique called "gradient
boosting".</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22"><span class="section-number-4">4.1.2</span> Interpretation of Hidden Units</h4>
<div class="outline-text-4" id="text-4-1-2">
<ul class="org-ul">
<li>Unlike Decision trees, the ANN structure is very opaque.</li>
<li>Difficult to interpret what it is doing.</li>
<li>One way is to look at the last layer of the ANN (the last perceptron) and
see what it's doing.  You could even assign labels to each of the inputs
for whatever concept you may believe they represent.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23"><span class="section-number-4">4.1.3</span> How Many Hidden Units?</h4>
<div class="outline-text-4" id="text-4-1-3">
<ul class="org-ul">
<li>Some work shows that it is better to start with a network that is too big.
<ul class="org-ul">
<li>Train until the error on the validation set grows.</li>
<li>Then look at the weights associated with edges, and prune the hidden
units that don't actually contribute.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">4.1.4</span> Recurrent ANNs</h4>
<div class="outline-text-4" id="text-4-1-4">
<ul class="org-ul">
<li>So far, we've looked at ANNs that feed forward.</li>
<li>There are also networks with loops, called "recurrent neural networks"
<ul class="org-ul">
<li>This gives ANNs a "memory" of previous inputs.</li>
<li>They are much more of a dynamic structure</li>
</ul></li>
<li>A recurrent ANN architecture with <i>rational weights</i> has computational
power equivalent to a Universal Turing Machine!!!!!
<ul class="org-ul">
<li>However, this is ridiculously hard to train (ya don't say&#x2026;)</li>
<li>Very prone to overfitting.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline25" class="outline-4">
<h4 id="orgheadline25"><span class="section-number-4">4.1.5</span> Pros/Cons of ANNs</h4>
<div class="outline-text-4" id="text-4-1-5">
<p>
Pros:
</p>
<ul class="org-ul">
<li>Very expressive hypothesis space</li>
<li>Very useful for classification, regression, density estimation</li>
<li>Builds useful representations "automatically"</li>
</ul>

<p>
Cons:
</p>
<ul class="org-ul">
<li>Easy to overfit.</li>
<li>Slow to train, require many examples.</li>
<li>Doesn't easily handle nominal data.</li>
<li>Opaque</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30"><span class="section-number-3">4.2</span> Comparing Learning Algorithms</h3>
