eecs440.org
*** Issue 1
    - Suppose we collect test data and evaluate a classifier.  Accuracy=$x$.
    - Then, someone repeats the experiment with another set of test data from the
      same problem, independent of the first set.
      - What can we say about the accuracy here?

*** Issue 2
    - Suppose now we have two different classifiers $A$ and $B$.  We measure
      their accuracies on a test set, and get $x$ and $y$, and $x > y$.  Does
      this mean $A$ is better than $B$ in this problem?
    - Or how about doing this with completely different algorithms?
      - If we repeated this experiment, we would get new $x'$ and $y'$.  Would
        we find that $x' > y'$ again?

*** It's All Just Statistics!

    - We're just looking at estimating the "true value" of a metric on the basis
      of a small sample.
    - Just like statistics!
    - *Definition:* Data Distribution: assume there is an unknown, underlying
      probability distribution, $D$, from which /unlabeled/ examples ($x$) are
      being sampled without replacement.
      - I.I.D.
    - *Definition:* Sample Error Rate: The fraction of examples in our test
      sample on which the learned classifier disagrees with the target concept.
      \begin{equation}
        e_s = \frac{1}{n} \sum_x \delta(y_x, \hat{y}_x)
      \end{equation}
    - *Definition:* True Error Rate: The probability that the learned classifier
      will make a mistake on a random example drawn from $D$.:
      \begin{equation}
        e_D = Pr_{x~D}(y_x \ne \hat{y}_x)
      \end{equation}
    - For problem #1, we want to know how are $e_S$ and $e_D$ related.
    - *Definition:* Sampling Distribution:
      - Suppose we perform a random experiment lots of times and record the
        outcome.
      - Call the random variable associated with the outcome $O$.
      - Suppose we then plot a frequency histogram of $O$.
      - something something something (see slides)
    - We'd like to get at the sampling distribution of the "error rate" r.v.,
      but we'll start with something easier.
    - Let $R$ be an rv denoting the number of errors in an evaluation
      experiment: (he changed slides too quick)
      - Sampling Distribution of $R$
        - Suppose we run $k$ experiment with test samples of size $n$
        - In the $i$th experiment our learned classifier makes $R=r_i$ errors.
        - We'll pot a frequency histogram of $R$.
        - What will it look like for $k$ large?
        - We have a Binomial distribution.  In the limit, this actually
          converges to a normal distribution.
        - This means we can infer the error rate $e_D$ (since $\mu=np$, $\sigma =
          ne_D(1-e_d)$)
      - If we do one trial and find that there are $r$ errors on $n$ examples, a
        good parameter estimate for $e_D$ is $\frac{r}{n}$.  Why?
      - This is a maximum likelihood estimation.  It is the parameter that
        maximizes the probability of the data.
    - *Definition:* Estimation Bias: Estimation bias of an estimator $Y$ for
      parameter $p$ is $E(Y)-p$.
      - If it has 0 bias, it converges asymptotically to the true value.
      - MLE has 0 estimation bias.
    - This is getting to some good math, but I can't summarize it in my notes
      right now if I want to understand it.  See slides.
    - Summary for Issue 1:
      - Determine sampling distribution of measure.
      - Estimate sampling distribution parameters using MLE on test set.
        - If necessary, approximate using standard distribution such as
          Gaussian.
      - Use tables to determine C% CI.
        - Usually use C=95
        - The true measure will lie in that interval with C% probability.

* 2015-09-17 Thursday

** Tradeoffs of Neural Networks

   - Lots of DoF!
     - Topology
     - Parameters
   - Easy to overfit.

** Training ANN

   We'll pretend that the network topology is already decided.  Here is the
   setup:

   \begin{equation}
     D = \left( \begin{array}{ccccc}
           x_{11} & \cdots & x_{1n} & -1 & y_1 \\
           \vdots & & \vdots & \vdots & \vdots \\
           x_{m1} & \cdots & x_{mn} & -1 & y_m
         \end{array} \right)
   \end{equation}

   - Want to find parameters $\vec{w} = (w_1, w_2, \cdots, \sigma)$.
   - Such that we minimize the "loss" function $L(\vec{w})$.
   - We can't use the sign function because it's not differentiable.
   - We can't use the dot product approximation.
   - Instead we use a sigmoid function $y = (1 - e^{x})$ I think.

   To train, we use Backpropagation!  This is gonna be fun.
   - Feed examples forward through the network.
   - Do layer-wise gradient descent starting at the output layer.

*** Backpropagation

    - Let $x_{ji}$ be the ith input to unit j.
    - Let $w_{ji}$ be the parameter associated with $x_{ji}$.
    - Let $n_j = \sum_i something$
    - Next up is the derivation of the derivative of the loss function for the
      output layer.  It's easy to follow, and I can't keep up with typing the
      math.  Check the slides!

    Backpropagation for hidden layers.
    - A perceptron $j$ only can affect the output from its downstream
      perceptrons, which we denote as $Downstream(j)$.
    - We can compute the derivative of the loss function with respect to the
      inputs of this perceptron, $\frac{dL}{dn_j}$, by computing the sum of
      $\frac{dL}{dn_k} \frac{dn_k}{dn_j}$ for all the $k\in{}Downstream(j)$.
      Excitingly, we already have $\frac{dL}{dn_k}$, since $k$ is dowstream of
      $j$,
    - The math is on the slides again, cause I'm not typing this stuff.  Still
      pretty easy to follow.

