eecs440.html
<div class="outline-text-3" id="text-4-2">
</div><div id="outline-container-orgheadline27" class="outline-4">
<h4 id="orgheadline27"><span class="section-number-4">4.2.1</span> Issue 1</h4>
<div class="outline-text-4" id="text-4-2-1">
<ul class="org-ul">
<li>Suppose we collect test data and evaluate a classifier.  Accuracy=\(x\).</li>
<li>Then, someone repeats the experiment with another set of test data from the
same problem, independent of the first set.
<ul class="org-ul">
<li>What can we say about the accuracy here?</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline28" class="outline-4">
<h4 id="orgheadline28"><span class="section-number-4">4.2.2</span> Issue 2</h4>
<div class="outline-text-4" id="text-4-2-2">
<ul class="org-ul">
<li>Suppose now we have two different classifiers \(A\) and \(B\).  We measure
their accuracies on a test set, and get \(x\) and \(y\), and \(x > y\).  Does
this mean \(A\) is better than \(B\) in this problem?</li>
<li>Or how about doing this with completely different algorithms?
<ul class="org-ul">
<li>If we repeated this experiment, we would get new \(x'\) and \(y'\).  Would
we find that \(x' > y'\) again?</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline29" class="outline-4">
<h4 id="orgheadline29"><span class="section-number-4">4.2.3</span> It's All Just Statistics!</h4>
<div class="outline-text-4" id="text-4-2-3">
<ul class="org-ul">
<li>We're just looking at estimating the "true value" of a metric on the basis
of a small sample.</li>
<li>Just like statistics!</li>
<li><b>Definition:</b> Data Distribution: assume there is an unknown, underlying
probability distribution, \(D\), from which <i>unlabeled</i> examples (\(x\)) are
being sampled without replacement.
<ul class="org-ul">
<li>I.I.D.</li>
</ul></li>
<li><p>
<b>Definition:</b> Sample Error Rate: The fraction of examples in our test
sample on which the learned classifier disagrees with the target concept.
</p>
\begin{equation}
  e_s = \frac{1}{n} \sum_x \delta(y_x, \hat{y}_x)
\end{equation}</li>
<li><p>
<b>Definition:</b> True Error Rate: The probability that the learned classifier
will make a mistake on a random example drawn from \(D\).:
</p>
\begin{equation}
  e_D = Pr_{x~D}(y_x \ne \hat{y}_x)
\end{equation}</li>
<li>For problem #1, we want to know how are \(e_S\) and \(e_D\) related.</li>
<li><b>Definition:</b> Sampling Distribution:
<ul class="org-ul">
<li>Suppose we perform a random experiment lots of times and record the
outcome.</li>
<li>Call the random variable associated with the outcome \(O\).</li>
<li>Suppose we then plot a frequency histogram of \(O\).</li>
<li>something something something (see slides)</li>
</ul></li>
<li>We'd like to get at the sampling distribution of the "error rate" r.v.,
but we'll start with something easier.</li>
<li>Let \(R\) be an rv denoting the number of errors in an evaluation
experiment: (he changed slides too quick)
<ul class="org-ul">
<li>Sampling Distribution of \(R\)
<ul class="org-ul">
<li>Suppose we run \(k\) experiment with test samples of size \(n\)</li>
<li>In the $i$th experiment our learned classifier makes \(R=r_i\) errors.</li>
<li>We'll pot a frequency histogram of \(R\).</li>
<li>What will it look like for \(k\) large?</li>
<li>We have a Binomial distribution.  In the limit, this actually
converges to a normal distribution.</li>
<li>This means we can infer the error rate \(e_D\) (since \(\mu=np\), \(\sigma =
          ne_D(1-e_d)\))</li>
</ul></li>
<li>If we do one trial and find that there are \(r\) errors on \(n\) examples, a
good parameter estimate for \(e_D\) is \(\frac{r}{n}\).  Why?</li>
<li>This is a maximum likelihood estimation.  It is the parameter that
maximizes the probability of the data.</li>
</ul></li>
<li><b>Definition:</b> Estimation Bias: Estimation bias of an estimator \(Y\) for
parameter \(p\) is \(E(Y)-p\).
<ul class="org-ul">
<li>If it has 0 bias, it converges asymptotically to the true value.</li>
<li>MLE has 0 estimation bias.</li>
</ul></li>
<li>This is getting to some good math, but I can't summarize it in my notes
right now if I want to understand it.  See slides.</li>
<li>Summary for Issue 1:
<ul class="org-ul">
<li>Determine sampling distribution of measure.</li>
<li>Estimate sampling distribution parameters using MLE on test set.
<ul class="org-ul">
<li>If necessary, approximate using standard distribution such as
Gaussian.</li>
</ul></li>
<li>Use tables to determine C% CI.
<ul class="org-ul">
<li>Usually use C=95</li>
<li>The true measure will lie in that interval with C% probability.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline39" class="outline-2">
<h2 id="orgheadline39"><span class="section-number-2">5</span> 2015-09-17 Thursday</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgheadline32" class="outline-3">
<h3 id="orgheadline32"><span class="section-number-3">5.1</span> Tradeoffs of Neural Networks</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Lots of DoF!
<ul class="org-ul">
<li>Topology</li>
<li>Parameters</li>
</ul></li>
<li>Easy to overfit.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline35" class="outline-3">
<h3 id="orgheadline35"><span class="section-number-3">5.2</span> Training ANN</h3>
<div class="outline-text-3" id="text-5-2">
<p>
We'll pretend that the network topology is already decided.  Here is the
setup:
</p>

\begin{equation}
  D = \left( \begin{array}{ccccc}
        x_{11} & \cdots & x_{1n} & -1 & y_1 \\
        \vdots & & \vdots & \vdots & \vdots \\
        x_{m1} & \cdots & x_{mn} & -1 & y_m
      \end{array} \right)
\end{equation}

<ul class="org-ul">
<li>Want to find parameters \(\vec{w} = (w_1, w_2, \cdots, \sigma)\).</li>
<li>Such that we minimize the "loss" function \(L(\vec{w})\).</li>
<li>We can't use the sign function because it's not differentiable.</li>
<li>We can't use the dot product approximation.</li>
<li>Instead we use a sigmoid function \(y = (1 - e^{x})\) I think.</li>
</ul>

<p>
To train, we use Backpropagation!  This is gonna be fun.
</p>
<ul class="org-ul">
<li>Feed examples forward through the network.</li>
<li>Do layer-wise gradient descent starting at the output layer.</li>
</ul>
</div>

<div id="outline-container-orgheadline33" class="outline-4">
<h4 id="orgheadline33"><span class="section-number-4">5.2.1</span> Backpropagation</h4>
<div class="outline-text-4" id="text-5-2-1">
<ul class="org-ul">
<li>Let \(x_{ji}\) be the ith input to unit j.</li>
<li>Let \(w_{ji}\) be the parameter associated with \(x_{ji}\).</li>
<li>Let \(n_j = \sum_i something\)</li>
<li>Next up is the derivation of the derivative of the loss function for the
output layer.  It's easy to follow, and I can't keep up with typing the
math.  Check the slides!</li>
</ul>

<p>
Backpropagation for hidden layers.
</p>
<ul class="org-ul">
<li>A perceptron \(j\) only can affect the output from its downstream
perceptrons, which we denote as \(Downstream(j)\).</li>
<li>We can compute the derivative of the loss function with respect to the
inputs of this perceptron, \(\frac{dL}{dn_j}\), by computing the sum of
\(\frac{dL}{dn_k} \frac{dn_k}{dn_j}\) for all the \(k\in{}Downstream(j)\).
Excitingly, we already have \(\frac{dL}{dn_k}\), since \(k\) is dowstream of
\(j\),</li>
<li>The math is on the slides again, cause I'm not typing this stuff.  Still
pretty easy to follow.</li>
</ul>
</div>
</div>
