eecs440.org
*** Example

    Consider a neural network with 2 input units, 2 hidden units, and 1 output
    unit, and all weights initialized to 1, with the bias set to zero.  Using
    squared loss, show the weights after the first backpropagation update with
    these examples.

    We have the inputs labelled 1 and 2, and then the two internal nodes labeled
    3 and 4, and the output node labeled 5.  Weights and x's are labeled
    accordingly.

    | x_1 | x_2 | f | $\hat{f}$ |
    | 0  | 0  | 0 | 0.731     |
    | 0  | 1  | 1 | 0.812     |

    Now that we have the initial outputs of the network, we can compute the
    derivatives for each example, and once we have all the derivatives we add up
    all the derivatives and compute the next step.

    Example 1:
    - Output layer: \(\frac{dL}{dw_{53}} = (0.731) (1 - 0.731) (0.5) (0.731 - 0) = 0.0719\)

    Example 2:
    - Output Layer: \(\frac{dL}{dw_{53}} = (0.812) (1 - 0.812) (0.731) (0.812 - 1) = -0.021\)

    Update:
    - \(w_{53}' = 1 - \eta (0.0719 - 0.021) = 0.949\) (assuming $\eta = 1$ for example).

** Overfitting in ANNs

   - They are very prone to overfitting, due to the large amount of parameters.
   - Can create very nonlinear decision surfaces.
   - You can impose a simple structure on the network, but then the network may
     not be capable of representing the true decision boundary.
   - Some strategies for controlling overfitting:

*** Weight Decay

    Add a "weight decay term" to keep the weights from growing:

    \(L_{OC}(\vec{y}, \hat{\vec{y}}, \vec{w}) = L(\vec{y}, \hat{\vec{y}}, \vec{w}) + \gamma \sum_i \sum_j w_{ji}^2\)

    If you have a large $\gamma$, your solution will tend to $w_{ji}$'s will tend toward
    zero, to minimize the effect of $\gamma$.  So it seems careful choice of $\gamma$ is
    pretty important.

** Implementation Issues

   You should standardize your inputs to zero mean, unit variance, so that your
   units don't have a massive effect on the network.

   Nominal features: you need to re-encode it.  You could do 1 of N input units.
   Or you could do logarithmic encoding, where each input is a binary code.

* 2015-09-15 Tuesday

** Famous Dead People

   - George Boole - father of Boolean algebra.
   - Someone else - neuroscience.
   - Frank Rosenblatt (may not be dead) - artificial neurons.

** History

   - We want "artificial intelligence."
   - Human brain is intelligent.
   - Try to simulate the structure of the brain to achieve intelligence

** Perceptron / Linear Threshold Unit

   - Has weighted ($w_i$) inputs ($x_i$).
   - Has Activation Threshold $\sigma$
   - Activation function is:

     \begin{equation}
       h(\vec{x}; \vec{w}, \sigma) = \left\{
       \begin{array}{ll}
         +1 & \text{if } \vec{w} \cdot \vec{x} \ge \sigma \\
         -1 & \text{else} \\
       \end{array}
       \right.
     \end{equation}

   - The parameters of the perceptron are $\vec{w}$ and $\sigma$.
     - There aren't really parameters of the decision tree algorithm, just the
       structure of the tree.

   - Example evaluation for perceptron $\vec{w}=(1,2)$, $\sigma=0.5$:

     | $x_1$ | $x_2$ |  h |
     |    0 |    0 | -1 |
     |    0 |    1 |  1 |

   - So, the question remains, how do we train them?

*** Training a Perceptron

    - Loss function: $L(\vec{w},\sigma)$
    - Measures the difference between the current estimates of $y$ ($\hat{y}$),
      and the true $y$ (which is known), over all training examples.
    - Our goal is to minimize the loss function with respect to $(\vec{w}, \sigma)$.
    - Notations:
      - Training data: (he changed the slide too quick)
    - Common loss function is "squared loss":
      \begin{equation}
        L(\vec{w}) = \frac{1}{2} \sum_{i=1}^m (y_i - \hat{y}_i)^2
                   = \frac{1}{2} \sum_{i=1}^m (y_i - sign(\vec{w}\cdot\vec{x}_i))^2
      \end{equation}
    - Sign function is not differentiable, so we'll replace it by dot product.
      \begin{equation}
        L(\vec{w}) = \frac{1}{2} \sum_{i=1}^m (y_i - \vec{w}\cdot\vec{x}_i)^2
      \end{equation}
    - Calculate gradient wrt $\vec{w}$
      \begin{equation}
        \frac{dL}{d\vec{w}} = \sum_{i=1}^m (y_i - \vec{w} \cdot \vec{x}_i)(-\vec{x}_i)
      \end{equation}
    - Parameter Update:
      \begin{equation}
        \vec{w} \gets \vec{w} - \eta \frac{dL}{d\vec{w}}
      \end{equation}
    - We can use gradient descent
      - Loss function is differentiable.
      - Loss function is bounded below by 0.
      - Loss function is convex (proof???)
      - This means there is a well-defined minimum for the loss function.
      - And, gradient descent will find it!
    - However, just cause the gradient descent converges, doesn't mean that it
      will converge to 0, since the true concept is not necessarily linear.
    - Stochastic G.D:
      \begin{array}{l}
        \frac{dL}{d\vec{w}} = (y_i - \vec{w} \cdot \vec{x}_i)(-\vec{x}_i) \\
        \vec{w} \gets \vec{w} - \eta \frac{dL}{d\vec{w}}
      \end{array}
      - This is done for each example instead of as a group.
      - Since the loss function is convex, it will converge to the same thing in
        the limit.
      - But the stochastic procedure will procede differently and maybe converge
        at a different speed.
      - Stochastic seems to give initial examples more "weight" in the direction
        of the search.
      - Stochastic is better for "online" learning, and for very large datasets.

