eecs440.html

<div id="outline-container-orgheadline34" class="outline-4">
<h4 id="orgheadline34"><span class="section-number-4">5.2.2</span> Example</h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
Consider a neural network with 2 input units, 2 hidden units, and 1 output
unit, and all weights initialized to 1, with the bias set to zero.  Using
squared loss, show the weights after the first backpropagation update with
these examples.
</p>

<p>
We have the inputs labelled 1 and 2, and then the two internal nodes labeled
3 and 4, and the output node labeled 5.  Weights and x's are labeled
accordingly.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">x<sub>1</sub></td>
<td class="org-right">x<sub>2</sub></td>
<td class="org-right">f</td>
<td class="org-right">\(\hat{f}\)</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0.731</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0.812</td>
</tr>
</tbody>
</table>

<p>
Now that we have the initial outputs of the network, we can compute the
derivatives for each example, and once we have all the derivatives we add up
all the derivatives and compute the next step.
</p>

<p>
Example 1:
</p>
<ul class="org-ul">
<li>Output layer: \(\frac{dL}{dw_{53}} = (0.731) (1 - 0.731) (0.5) (0.731 - 0) = 0.0719\)</li>
</ul>

<p>
Example 2:
</p>
<ul class="org-ul">
<li>Output Layer: \(\frac{dL}{dw_{53}} = (0.812) (1 - 0.812) (0.731) (0.812 - 1) = -0.021\)</li>
</ul>

<p>
Update:
</p>
<ul class="org-ul">
<li>\(w_{53}' = 1 - \eta (0.0719 - 0.021) = 0.949\) (assuming \(\eta = 1\) for example).</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline37" class="outline-3">
<h3 id="orgheadline37"><span class="section-number-3">5.3</span> Overfitting in ANNs</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>They are very prone to overfitting, due to the large amount of parameters.</li>
<li>Can create very nonlinear decision surfaces.</li>
<li>You can impose a simple structure on the network, but then the network may
not be capable of representing the true decision boundary.</li>
<li>Some strategies for controlling overfitting:</li>
</ul>
</div>

<div id="outline-container-orgheadline36" class="outline-4">
<h4 id="orgheadline36"><span class="section-number-4">5.3.1</span> Weight Decay</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
Add a "weight decay term" to keep the weights from growing:
</p>

<p>
\(L_{OC}(\vec{y}, \hat{\vec{y}}, \vec{w}) = L(\vec{y}, \hat{\vec{y}}, \vec{w}) + \gamma \sum_i \sum_j w_{ji}^2\)
</p>

<p>
If you have a large \(\gamma\), your solution will tend to $w<sub>ji</sub>$'s will tend toward
zero, to minimize the effect of \(\gamma\).  So it seems careful choice of \(\gamma\) is
pretty important.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline38" class="outline-3">
<h3 id="orgheadline38"><span class="section-number-3">5.4</span> Implementation Issues</h3>
<div class="outline-text-3" id="text-5-4">
<p>
You should standardize your inputs to zero mean, unit variance, so that your
units don't have a massive effect on the network.
</p>

<p>
Nominal features: you need to re-encode it.  You could do 1 of N input units.
Or you could do logarithmic encoding, where each input is a binary code.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline46" class="outline-2">
<h2 id="orgheadline46"><span class="section-number-2">6</span> 2015-09-15 Tuesday</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-orgheadline40" class="outline-3">
<h3 id="orgheadline40"><span class="section-number-3">6.1</span> Famous Dead People</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>George Boole - father of Boolean algebra.</li>
<li>Someone else - neuroscience.</li>
<li>Frank Rosenblatt (may not be dead) - artificial neurons.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline41" class="outline-3">
<h3 id="orgheadline41"><span class="section-number-3">6.2</span> History</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>We want "artificial intelligence."</li>
<li>Human brain is intelligent.</li>
<li>Try to simulate the structure of the brain to achieve intelligence</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline45" class="outline-3">
<h3 id="orgheadline45"><span class="section-number-3">6.3</span> Perceptron / Linear Threshold Unit</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li>Has weighted (\(w_i\)) inputs (\(x_i\)).</li>
<li>Has Activation Threshold \(\sigma\)</li>
<li><p>
Activation function is:
</p>

\begin{equation}
  h(\vec{x}; \vec{w}, \sigma) = \left\{
  \begin{array}{ll}
    +1 & \text{if } \vec{w} \cdot \vec{x} \ge \sigma \\
    -1 & \text{else} \\
  \end{array}
  \right.
\end{equation}</li>

<li>The parameters of the perceptron are \(\vec{w}\) and \(\sigma\).
<ul class="org-ul">
<li>There aren't really parameters of the decision tree algorithm, just the
structure of the tree.</li>
</ul></li>

<li><p>
Example evaluation for perceptron \(\vec{w}=(1,2)\), \(\sigma=0.5\):
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">\(x_1\)</td>
<td class="org-right">\(x_2\)</td>
<td class="org-right">h</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">-1</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table></li>

<li>So, the question remains, how do we train them?</li>
</ul>
</div>

<div id="outline-container-orgheadline42" class="outline-4">
<h4 id="orgheadline42"><span class="section-number-4">6.3.1</span> Training a Perceptron</h4>
<div class="outline-text-4" id="text-6-3-1">
<ul class="org-ul">
<li>Loss function: \(L(\vec{w},\sigma)\)</li>
<li>Measures the difference between the current estimates of \(y\) (\(\hat{y}\)),
and the true \(y\) (which is known), over all training examples.</li>
<li>Our goal is to minimize the loss function with respect to \((\vec{w}, \sigma)\).</li>
<li>Notations:
<ul class="org-ul">
<li>Training data: (he changed the slide too quick)</li>
</ul></li>
<li><p>
Common loss function is "squared loss":
</p>
\begin{equation}
  L(\vec{w}) = \frac{1}{2} \sum_{i=1}^m (y_i - \hat{y}_i)^2
             = \frac{1}{2} \sum_{i=1}^m (y_i - sign(\vec{w}\cdot\vec{x}_i))^2
\end{equation}</li>
<li><p>
Sign function is not differentiable, so we'll replace it by dot product.
</p>
\begin{equation}
  L(\vec{w}) = \frac{1}{2} \sum_{i=1}^m (y_i - \vec{w}\cdot\vec{x}_i)^2
\end{equation}</li>
<li><p>
Calculate gradient wrt \(\vec{w}\)
</p>
\begin{equation}
  \frac{dL}{d\vec{w}} = \sum_{i=1}^m (y_i - \vec{w} \cdot \vec{x}_i)(-\vec{x}_i)
\end{equation}</li>
<li><p>
Parameter Update:
</p>
\begin{equation}
  \vec{w} \gets \vec{w} - \eta \frac{dL}{d\vec{w}}
\end{equation}</li>
<li>We can use gradient descent
<ul class="org-ul">
<li>Loss function is differentiable.</li>
<li>Loss function is bounded below by 0.</li>
<li>Loss function is convex (proof???)</li>
<li>This means there is a well-defined minimum for the loss function.</li>
<li>And, gradient descent will find it!</li>
</ul></li>
<li>However, just cause the gradient descent converges, doesn't mean that it
will converge to 0, since the true concept is not necessarily linear.</li>
<li><p>
Stochastic G.D:
</p>
\begin{array}{l}
  \frac{dL}{d\vec{w}} = (y_i - \vec{w} \cdot \vec{x}_i)(-\vec{x}_i) \\
  \vec{w} \gets \vec{w} - \eta \frac{dL}{d\vec{w}}
\end{array}
<ul class="org-ul">
<li>This is done for each example instead of as a group.</li>
<li>Since the loss function is convex, it will converge to the same thing in
the limit.</li>
<li>But the stochastic procedure will procede differently and maybe converge
at a different speed.</li>
<li>Stochastic seems to give initial examples more "weight" in the direction
of the search.</li>
<li>Stochastic is better for "online" learning, and for very large datasets.</li>
</ul></li>
</ul>
</div>
</div>
