eecs440.org
*** More on Perceptrons

    - Geometry of the perceptron:
      - In one dimension, it is a step function.
      - In two dimensions, the separating surface is a line.
      - In three dimensions, the separating surface is a plane.
      - So, in general, the decision surface is a hyperplane.
    - Loss function is 0 when the surface completely separates the examples with
      no errors.  It is non-0 when there are some wrong ones.
    - Linear separability is whether or not a dataset can be separated by a
      linear function without error.
    - The perceptron is not nearly as powerful as a decision tree (can't
      separate things like exclusive or).
    - So, it is more resistant to overfitting.  (which we will quantify later)
    - It can do some logic:
      - Conjunctions:
        \begin{array}{l}
          x_1 \land x_2 \land x_3 \leftrightarrow y \\
          1 \cdot x_1 + 1 \cdot x_2 + 1 \cdot x_3 \ge 3
        \end{array}
      - At least $m$-of-$n$:
        \begin{array}{l}
          (x_1 \land x_2) \lor (x_1 \land x_3) \lor (x_2 \land x_3) \leftrightarrow y \\
          1 \cdot x_1 + 1 \cdot x_2 + 1 \cdot x_3 \ge 2
        \end{array}
    - But not all:
      - Complex disjunctions
      - Exclusive or!!
    - Can fix this by using more perceptrons hooked up to each other.
    - The neural network for exclusive or looks remarkably similar to the logic
      gate circuit for XOR :D
    - It involves a "hidden" layer that isn't part of the output.

*** Feedforward Network Topology

    - Essentially, a directed acyclic graph of perceptrons.
    - But, it may be that you have to follow the layer structure.
    - Representation ability
      - Every boolean function can be represented by a network w/ one hidden
        layer.
      - Every bounded continuous function can be represented by a network with
        one hidden layer.
      - Every function in R^n can be represented by a network with two hidden
        layers.
      - Woah.
    - This gives you a tradeoff...
      - You end up with the possibility for a lot of overfitting (many degrees
        of freedom and high representation ability).
      - It also takes a long time to train these networks if they are complex.

* 2015-09-10 Thursday

** Evaluation Methods and Metrics

   How do you figure out if your algorithm is "good"?

   Goal: find a measure *expected future performance* of the learning algorithm
   for some problem.  How?

   Idea:
   - Separate available data into sets for training and evaluation.
   - The examples for evaluation will be new to the learned classifier.
   - Do this lots of times to get reliable estimates.
   - The sets should be "separate" at least in the sense of independently
     chosen, if not disjoint examples.

*** n-fold Cross Validation

    - Generally, the number of examples is limited.
    - Want to train on sets that are as large as possible.
    - Divide set into $n$ separate sets.
      - For each set, withhold it for testing, and train on the remaining sets.
      - Then evaluate the classifier on the testing sets.
    - Special case of $n$-fold cross validation: Leave-one-out
      - $n$ examples, $n$ folds.
      - Only really useful if you have a few examples.
      - Called "jackknife" in statistics literature.
    - Stratified cross validation
      - Same as $n$-fold cross validation, but you sample folds such that the
        proportions of class labels is preserved in each fold.
      - More stable performance estimates.
      - Implementation:
        - Put $pos$ positive examples in one list, and $neg$ negative examples
          in another.
        - Randomly shuffle the lists.
        - Put the first $pos/n$ positives in fold 1, the next into fold 2, etc.
        - Repeat for negatives.
        - Assign leftover examples randomly.

*** Metrics for Classification

    Contingency Table

    |              | Positive (TC)                | Negative (TC)                |
    | Positive (C) | True Positive (TP)           | False Positives (FP, Type I) |
    | Negative (C) | False Negative (FN, Type II) | True Negative (TN)           |

    Can compute all metrics from the contingency table.

    - Accuracy: most commonly used measure for comparing algorithms.
      \begin{equation}
        \text{Accuracy} = \frac{TP + TN}{TP + FP + TN + FN}
      \end{equation}
      - Simply the fraction of examples that are correctly classified.
      - There are many problems with accuracy.
        - Skewed class distribution: eg, if 99% animals aren't lions, a
          classifier with 99% accuracy would just predict "not lion".  And it
          would kill you next time you see a lion.
        - Differential misclassification costs: some types of errors (FP or FN)
          are more serious for an application than others (eg screening for a
          disease).  Accuracy treats them equally.
    - Weighted Accuracy
      \begin{equation}
        \text{WAcc} = \frac{1}{2}\left(\frac{TP}{Allpos} + \frac{TN}{Allneg}\right)
                    = \frac{1}{2}\left(\frac{TP}{TP + FN} + \frac{TN}{TN + FP}\right)
      \end{equation}
      - First part is the "true positive rate" (how many positives are correctly
        identified)
      - Second part is the "true negative rate" (how many negatives are
        correctly identified)
    - Precision
      \begin{equation}
        \text{Precision} = \frac{TP}{TP + FP}
      \end{equation}
      - Sometimes, the "positive" case is all you're interested in.
      - This measures "of all the examples classified positive, how many were
        actually positive?"
    - Recall / True Positive Rate / Sensitivity
      \begin{equation}
        \text{Recall} = \frac{TP}{TP + FN}
      \end{equation}
      - This quantifies "of all the positive examples, how many were correctly
        classified?"
    - Specificity
      \begin{equation}
        \text{Specificity} = \frac{TN}{TN + FP}
      \end{equation}
      - Conterpart of recall for the negative class.
    - F1
      \begin{equation}
        \frac{1}{F1} = \frac{1}{2} \left( \frac{1}{Precision} + \frac{1}{Recall}\right)
      \end{equation}
      \begin{equation}
        F1 = \frac{2}{\left( \frac{1}{Precision} + \frac{1}{Recall}\right)}
      \end{equation}
      - Combines precision and recall into single measure.
      - Not necessarily a good idea, but widely used.

*** Learning Curves

    - Frequently it's useful to plot metrics as a function of sample size.
    - Provides insight into how many examples the algorithm needs to be
      effective.

