eecs440.html

<div id="outline-container-orgheadline43" class="outline-4">
<h4 id="orgheadline43"><span class="section-number-4">6.3.2</span> More on Perceptrons</h4>
<div class="outline-text-4" id="text-6-3-2">
<ul class="org-ul">
<li>Geometry of the perceptron:
<ul class="org-ul">
<li>In one dimension, it is a step function.</li>
<li>In two dimensions, the separating surface is a line.</li>
<li>In three dimensions, the separating surface is a plane.</li>
<li>So, in general, the decision surface is a hyperplane.</li>
</ul></li>
<li>Loss function is 0 when the surface completely separates the examples with
no errors.  It is non-0 when there are some wrong ones.</li>
<li>Linear separability is whether or not a dataset can be separated by a
linear function without error.</li>
<li>The perceptron is not nearly as powerful as a decision tree (can't
separate things like exclusive or).</li>
<li>So, it is more resistant to overfitting.  (which we will quantify later)</li>
<li>It can do some logic:
<ul class="org-ul">
<li><p>
Conjunctions:
</p>
\begin{array}{l}
  x_1 \land x_2 \land x_3 \leftrightarrow y \\
  1 \cdot x_1 + 1 \cdot x_2 + 1 \cdot x_3 \ge 3
\end{array}</li>
<li><p>
At least $m$-of-\(n\):
</p>
\begin{array}{l}
  (x_1 \land x_2) \lor (x_1 \land x_3) \lor (x_2 \land x_3) \leftrightarrow y \\
  1 \cdot x_1 + 1 \cdot x_2 + 1 \cdot x_3 \ge 2
\end{array}</li>
</ul></li>
<li>But not all:
<ul class="org-ul">
<li>Complex disjunctions</li>
<li>Exclusive or!!</li>
</ul></li>
<li>Can fix this by using more perceptrons hooked up to each other.</li>
<li>The neural network for exclusive or looks remarkably similar to the logic
gate circuit for XOR :D</li>
<li>It involves a "hidden" layer that isn't part of the output.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline44" class="outline-4">
<h4 id="orgheadline44"><span class="section-number-4">6.3.3</span> Feedforward Network Topology</h4>
<div class="outline-text-4" id="text-6-3-3">
<ul class="org-ul">
<li>Essentially, a directed acyclic graph of perceptrons.</li>
<li>But, it may be that you have to follow the layer structure.</li>
<li>Representation ability
<ul class="org-ul">
<li>Every boolean function can be represented by a network w/ one hidden
layer.</li>
<li>Every bounded continuous function can be represented by a network with
one hidden layer.</li>
<li>Every function in R<sup>n</sup> can be represented by a network with two hidden
layers.</li>
<li>Woah.</li>
</ul></li>
<li>This gives you a tradeoff&#x2026;
<ul class="org-ul">
<li>You end up with the possibility for a lot of overfitting (many degrees
of freedom and high representation ability).</li>
<li>It also takes a long time to train these networks if they are complex.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline52" class="outline-2">
<h2 id="orgheadline52"><span class="section-number-2">7</span> 2015-09-10 Thursday</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-orgheadline51" class="outline-3">
<h3 id="orgheadline51"><span class="section-number-3">7.1</span> Evaluation Methods and Metrics</h3>
<div class="outline-text-3" id="text-7-1">
<p>
How do you figure out if your algorithm is "good"?
</p>

<p>
Goal: find a measure <b>expected future performance</b> of the learning algorithm
for some problem.  How?
</p>

<p>
Idea:
</p>
<ul class="org-ul">
<li>Separate available data into sets for training and evaluation.</li>
<li>The examples for evaluation will be new to the learned classifier.</li>
<li>Do this lots of times to get reliable estimates.</li>
<li>The sets should be "separate" at least in the sense of independently
chosen, if not disjoint examples.</li>
</ul>
</div>

<div id="outline-container-orgheadline47" class="outline-4">
<h4 id="orgheadline47"><span class="section-number-4">7.1.1</span> n-fold Cross Validation</h4>
<div class="outline-text-4" id="text-7-1-1">
<ul class="org-ul">
<li>Generally, the number of examples is limited.</li>
<li>Want to train on sets that are as large as possible.</li>
<li>Divide set into \(n\) separate sets.
<ul class="org-ul">
<li>For each set, withhold it for testing, and train on the remaining sets.</li>
<li>Then evaluate the classifier on the testing sets.</li>
</ul></li>
<li>Special case of $n$-fold cross validation: Leave-one-out
<ul class="org-ul">
<li>\(n\) examples, \(n\) folds.</li>
<li>Only really useful if you have a few examples.</li>
<li>Called "jackknife" in statistics literature.</li>
</ul></li>
<li>Stratified cross validation
<ul class="org-ul">
<li>Same as $n$-fold cross validation, but you sample folds such that the
proportions of class labels is preserved in each fold.</li>
<li>More stable performance estimates.</li>
<li>Implementation:
<ul class="org-ul">
<li>Put \(pos\) positive examples in one list, and \(neg\) negative examples
in another.</li>
<li>Randomly shuffle the lists.</li>
<li>Put the first \(pos/n\) positives in fold 1, the next into fold 2, etc.</li>
<li>Repeat for negatives.</li>
<li>Assign leftover examples randomly.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline48" class="outline-4">
<h4 id="orgheadline48"><span class="section-number-4">7.1.2</span> Metrics for Classification</h4>
<div class="outline-text-4" id="text-7-1-2">
<p>
Contingency Table
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Positive (TC)</td>
<td class="org-left">Negative (TC)</td>
</tr>

<tr>
<td class="org-left">Positive (C)</td>
<td class="org-left">True Positive (TP)</td>
<td class="org-left">False Positives (FP, Type I)</td>
</tr>

<tr>
<td class="org-left">Negative (C)</td>
<td class="org-left">False Negative (FN, Type II)</td>
<td class="org-left">True Negative (TN)</td>
</tr>
</tbody>
</table>

<p>
Can compute all metrics from the contingency table.
</p>

<ul class="org-ul">
<li><p>
Accuracy: most commonly used measure for comparing algorithms.
</p>
\begin{equation}
  \text{Accuracy} = \frac{TP + TN}{TP + FP + TN + FN}
\end{equation}
<ul class="org-ul">
<li>Simply the fraction of examples that are correctly classified.</li>
<li>There are many problems with accuracy.
<ul class="org-ul">
<li>Skewed class distribution: eg, if 99% animals aren't lions, a
classifier with 99% accuracy would just predict "not lion".  And it
would kill you next time you see a lion.</li>
<li>Differential misclassification costs: some types of errors (FP or FN)
are more serious for an application than others (eg screening for a
disease).  Accuracy treats them equally.</li>
</ul></li>
</ul></li>
<li><p>
Weighted Accuracy
</p>
\begin{equation}
  \text{WAcc} = \frac{1}{2}\left(\frac{TP}{Allpos} + \frac{TN}{Allneg}\right)
              = \frac{1}{2}\left(\frac{TP}{TP + FN} + \frac{TN}{TN + FP}\right)
\end{equation}
<ul class="org-ul">
<li>First part is the "true positive rate" (how many positives are correctly
identified)</li>
<li>Second part is the "true negative rate" (how many negatives are
correctly identified)</li>
</ul></li>
<li><p>
Precision
</p>
\begin{equation}
  \text{Precision} = \frac{TP}{TP + FP}
\end{equation}
<ul class="org-ul">
<li>Sometimes, the "positive" case is all you're interested in.</li>
<li>This measures "of all the examples classified positive, how many were
actually positive?"</li>
</ul></li>
<li><p>
Recall / True Positive Rate / Sensitivity
</p>
\begin{equation}
  \text{Recall} = \frac{TP}{TP + FN}
\end{equation}
<ul class="org-ul">
<li>This quantifies "of all the positive examples, how many were correctly
classified?"</li>
</ul></li>
<li><p>
Specificity
</p>
\begin{equation}
  \text{Specificity} = \frac{TN}{TN + FP}
\end{equation}
<ul class="org-ul">
<li>Conterpart of recall for the negative class.</li>
</ul></li>
<li><p>
F1
</p>
\begin{equation}
  \frac{1}{F1} = \frac{1}{2} \left( \frac{1}{Precision} + \frac{1}{Recall}\right)
\end{equation}
\begin{equation}
  F1 = \frac{2}{\left( \frac{1}{Precision} + \frac{1}{Recall}\right)}
\end{equation}
<ul class="org-ul">
<li>Combines precision and recall into single measure.</li>
<li>Not necessarily a good idea, but widely used.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline49" class="outline-4">
<h4 id="orgheadline49"><span class="section-number-4">7.1.3</span> Learning Curves</h4>
<div class="outline-text-4" id="text-7-1-3">
<ul class="org-ul">
<li>Frequently it's useful to plot metrics as a function of sample size.</li>
<li>Provides insight into how many examples the algorithm needs to be
effective.</li>
</ul>
</div>
</div>
