eecs440.html

<div id="outline-container-orgheadline50" class="outline-4">
<h4 id="orgheadline50"><span class="section-number-4">7.1.4</span> Metrics with Confidence Measures</h4>
<div class="outline-text-4" id="text-7-1-4">
<ul class="org-ul">
<li>Many learning algorithms produce classifiers or models that provide
estimates of how confident they are.</li>
<li>Can use this to create Precision/Recall curves or Receiver Operator
Characteristic curves.</li>
<li>Precision/Recall curves:
<ul class="org-ul">
<li>plot precision, recall as you change threshold.</li>
</ul></li>
<li>ROC graphs
<ul class="org-ul">
<li>plot FPR x , TPR y as you change threshold.</li>
<li>Random guessing is a diagonal line.
<ul class="org-ul">
<li>Also majority class classifier.</li>
<li>Good classifier mst be above the diagonal.</li>
</ul></li>
<li>Monotonically increasing.</li>
<li>Can be misleading if class distribution is too skewed.
<ul class="org-ul">
<li>Use PR instead.</li>
</ul></li>
<li>Frequently use AUC as statistic.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline57" class="outline-2">
<h2 id="orgheadline57"><span class="section-number-2">8</span> 2015-09-08 Tuesday</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-orgheadline53" class="outline-3">
<h3 id="orgheadline53"><span class="section-number-3">8.1</span> Review:</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>Decision trees: trees where internal nodes are tests on attributes, and
leaves are class labels.</li>
<li>Construct them by choosing attributes which give the most information.</li>
<li>Measure this information with entropy, mutual information ("information
gain").</li>
<li>ID3 algorithm is the formal algorithm for applying mutual information to
constructing decision trees.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline54" class="outline-3">
<h3 id="orgheadline54"><span class="section-number-3">8.2</span> Generalizing ID3</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>What about multiple valued attributes (more than 2-valued)?
<ul class="org-ul">
<li>Mutual information still applies to $v$-valued finite, discrete
variables.</li>
<li>You simply have the internal node for that attribute have \(v\) children
instead of 2.</li>
<li>However, the maximum mutual information for a \(k\) valued variable is
\(\log{k}\), so the IG function is biased towards attributes with many
values.</li>
<li>Can normalize by dividing by \(H(X)\), the entropy of the attribute itself.
<ul class="org-ul">
<li><b>Question:</b> why is this better than dividing by \(\log{|X|}\), e.g., the
maximum overall entropy of \(H(X)\)?</li>
<li>In essence, this division gives you a quantity that answers the
question "what fraction of this variable's entropy contributes
information about the class label?"</li>
</ul></li>
</ul></li>
<li>Continuous Attributes
<ul class="org-ul">
<li>Continuous variables have entropy defined on them, but it's useless for
making a decision in a tree.</li>
<li>Need to "bin" the attribute (\(X \le v\) or \(X \ge v\)).</li>
<li>You only need to consider values for \(v\) that separate different class
labels in the training set.
<ul class="org-ul">
<li>This is still problematic for large training sets, as we'll see on our
programming assignment.</li>
</ul></li>
</ul></li>
</ul>

<p>
Example
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Color</td>
<td class="org-right">Area</td>
<td class="org-left">Shape</td>
<td class="org-right">Class Label</td>
</tr>

<tr>
<td class="org-left">red</td>
<td class="org-right">0.1</td>
<td class="org-left">circle</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">red</td>
<td class="org-right">0.7</td>
<td class="org-left">square</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">red</td>
<td class="org-right">0.4</td>
<td class="org-left">triangle</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">blue</td>
<td class="org-right">0.2</td>
<td class="org-left">triangle</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">blue</td>
<td class="org-right">0.6</td>
<td class="org-left">circle</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">blue</td>
<td class="org-right">0.8</td>
<td class="org-left">square</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">green</td>
<td class="org-right">0.4</td>
<td class="org-left">square</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">green</td>
<td class="org-right">0.3</td>
<td class="org-left">triangle</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">green</td>
<td class="org-right">0.3</td>
<td class="org-left">circle</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>

<ol class="org-ol">
<li>First, compute H(Y), which is \(H(\frac{1}{3})\) (as a shorthand).</li>
<li><p>
Then, compute H(Y|Color):
</p>

\begin{equation}
H(Y|Color) = p(Color=red)H(Y|Color=red) + p(Color=blue)H(Y|color=blue) + p(Color=green)H(Y|Color=green)
\end{equation}

\begin{equation}
H(Y|Color) = \frac{1}{3}H(\frac{1}{3}) + \frac{1}{3}H(\frac{1}{3}) + \frac{1}{3}\times 0
\end{equation}

\begin{equation}
H(Y|Color) = \frac{2}{3}H(\frac{1}{3})
\end{equation}</li>

<li><p>
We can use this to compute the information gain of Color.
</p>

\begin{equation}
IG(Color) = H(Y) - H(Y|Color) = \frac{1}{3} H(\frac{1}{3})
\end{equation}</li>

<li>Conveniently, this is the same as the information gain of Shape.</li>

<li><p>
For area, if we sort the training set by Area, we find the cutoffs 0.25,
0.35, and 0.5.  Then we can compute H(Y|Area,v) for each cutoff v.
</p>

<p>
\(H(Y|Area\le0.25) = \frac{2}{9}\times 0 + \frac{7}{9} H(\frac{1}{7})\), so IG(Area&le; 0.25) = 0.4583
</p>

<p>
etc for each cutoff
</p></li>

<li>You choose the best IG, and use that for the root node.  Then continue to
do this for each child node.</li>
</ol>
</div>
</div>

<div id="outline-container-orgheadline56" class="outline-3">
<h3 id="orgheadline56"><span class="section-number-3">8.3</span> Overfitting</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li>Given enough features, ID3 will create a tree that fits your data perfectly.
<ul class="org-ul">
<li>Enough features = enough that there are no contradictory examples.</li>
</ul></li>
<li>Overfitting is an issue.</li>

<li>What is overfitting?  Making your model too specific to your training
examples, and not general enough to be applied well to new data.</li>

<li>Strictly, if a concept \(h\) has:

<ul class="org-ul">
<li>Higher performance on the training examples, but</li>
<li>Lower performance on the whole dataset</li>
</ul></li>

<li>Than some other concept \(h'\), then we say that \(h\) has overfit the training
data.</li>
</ul>
</div>

<div id="outline-container-orgheadline55" class="outline-4">
<h4 id="orgheadline55"><span class="section-number-4">8.3.1</span> Controlling Overfitting</h4>
<div class="outline-text-4" id="text-8-3-1">
<ul class="org-ul">
<li>Can introduce a restriction on the hypothesis space, to prevent overly
complex hypotheses from being learned.</li>
<li>Early Stopping
<ul class="org-ul">
<li>Standard ID3 algorithm stops when IG(X)=0 for all X.</li>
<li>Instead, stop when IG(X) &le; &epsilon;, for some chosen &epsilon;.</li>
<li>This is sensitive to your parameter choice for &epsilon;.</li>
<li>It's easy to implement, but doesn't work well in practice.</li>
</ul></li>
<li>Greedy post-pruning
<ul class="org-ul">
<li>Hold aside some training examples at the start.</li>
<li>Do your training procedure on the remainder (allowing it to overfit if
it wants).</li>
<li>Then, do a <i>greedy pruning</i> algorithm on your model.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline73" class="outline-2">
<h2 id="orgheadline73"><span class="section-number-2">9</span> 2015-09-01 Tuesday</h2>
<div class="outline-text-2" id="text-9">
<p>
HW1 due tonight at midnight.  HW 2 out today.  Read Ch. 3 in Mitchell.
</p>
</div>
