eecs440.html

<div id="outline-container-orgheadline67" class="outline-3">
<h3 id="orgheadline67"><span class="section-number-3">9.1</span> What is "Machine Learning?"</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li>Machine = autonomous system, with no (or limited) human intervention.</li>
<li>Learning?
<ul class="org-ul">
<li>System changes after an experience, so that it can work more effectively
next time it does the task.</li>
<li>We want the system to learn how to do <i>related</i> tasks better too.</li>
</ul></li>
<li>Specification for a learning system:
<ul class="org-ul">
<li>Given: Task goal, performance measure P, and examples E</li>
<li>Produce a <b>concept</b> that is good wih respect to P on <i>all</i> examples of
the task.</li>
</ul></li>
<li>Example: learn to play chess
<ul class="org-ul">
<li>Perforance measure = games won/lost</li>
<li>Examples = games played</li>
<li>Concept?  Probably a function mapping a current board state to a move to
play next.</li>
</ul></li>
<li>Two phases: learning/training, and evaluation/testing
<ul class="org-ul">
<li>(In the evaluation phase, you want to evaluate on new examples that you
haven't trained on).</li>
</ul></li>
<li>Batch learning: one learning phase, with a large set of examples, followed
by a testing phase.</li>
<li>Online learning: examples arrive one at a time (or in small groups);
learning and evaluation phases iterate.</li>
<li>Learning systems need to have some sort of constraint.  Memorizing all the
examples is probably the best strategy, but we know that this doesn't
represent learning the underlying concept.</li>
</ul>
</div>

<div id="outline-container-orgheadline58" class="outline-4">
<h4 id="orgheadline58"><span class="section-number-4">9.1.1</span> Inductive Generalization</h4>
<div class="outline-text-4" id="text-9-1-1">
<ul class="org-ul">
<li>In all learning problems, need to reason from specific examples to a
general case.</li>
<li>(this is the reverse of deductive reasoning, where you reason from the
general case to the specific case)</li>
<li>Target concept = the underlying concept that the system is trying to
learn.  EG, Gary kasparov's head.</li>
<li>Typically, the performance measure quantifies the difference between
current and target concepts.</li>
<li>Hypothesis space - all concepts the learning system will consider
(e.g. all possible combinations of animal properties)</li>
<li>Hopefully, target concept is in the hypothesis space.
<ul class="org-ul">
<li>But can't include every possible hypothesis in your space.</li>
<li>The size would be huge.</li>
<li>You would end up memorizing, not learning.</li>
</ul></li>
<li>This is the idea behind "No Tabula Rasa" (blank slate) learning.  There
has to be some sort of restriction on hypothesis spaces.</li>
<li>Inductive Bias
<ul class="org-ul">
<li>Assumptions used to limit the hypothesis space are the inductive bias.</li>
<li>The more assumptions, the stronger the bias.</li>
<li>It can even be quantified (later)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline66" class="outline-4">
<h4 id="orgheadline66"><span class="section-number-4">9.1.2</span> Learning Settings</h4>
<div class="outline-text-4" id="text-9-1-2">
</div><ol class="org-ol"><li><a id="orgheadline59"></a>Supervised Learning<br  /><div class="outline-text-5" id="text-9-1-2-1">
<ul class="org-ul">
<li>Examples are annotated by a teacheer or oracle.</li>
<li>Learning system just finds the concept to match the annotations.</li>
</ul>
</div></li>

<li><a id="orgheadline60"></a>Unsupervised Learning<br  /><div class="outline-text-5" id="text-9-1-2-2">
<ul class="org-ul">
<li>No annotations</li>
<li>Goal is to find interesting patterns in the examples</li>
<li>System defines what is interesting.</li>
<li>Example: grouping images by content.</li>
</ul>
</div></li>

<li><a id="orgheadline61"></a>Semi-Supervised Learning<br  /><div class="outline-text-5" id="text-9-1-2-3">
<ul class="org-ul">
<li>"<b>normal learning</b>" is really a combination of the two</li>
<li>You do unsupervised learning, and you occasionally get your
"parent"/oracle to come in and teach you some labels.</li>
<li>You use those new concepts to help you organize your thoughts better.</li>
</ul>
</div></li>

<li><a id="orgheadline62"></a>Active Learning<br  /><div class="outline-text-5" id="text-9-1-2-4">
<ul class="org-ul">
<li>A few examples are annotated with the target concept.</li>
<li>Learning system can "ask" the oracle to label something.</li>
<li>There is a cost of labelling that the system must optimize.</li>
</ul>
</div></li>

<li><a id="orgheadline63"></a>Transductive Learning<br  /><div class="outline-text-5" id="text-9-1-2-5">
<ul class="org-ul">
<li>Learning system has some knowledge of possible examples it will be
evaluated on.</li>
<li>Adjusts the system to do better on those examples.</li>
<li>EG - learn to play chess against Kasparov.</li>
</ul>
</div></li>

<li><a id="orgheadline64"></a>Reinforcement Learning<br  /><div class="outline-text-5" id="text-9-1-2-6">
<ul class="org-ul">
<li>This is "sequential" learning.</li>
<li>Your environment provides feedback.</li>
<li>You take actions and use the consequences to learn.</li>
</ul>
</div></li>

<li><a id="orgheadline65"></a>Transfer Learning<br  /><div class="outline-text-5" id="text-9-1-2-7">
<ul class="org-ul">
<li>Human learning is cumulative.
<ul class="org-ul">
<li>When we encounter a new problem, we don't just start from scratch.</li>
<li>We use prior knowledge and reasoning.</li>
</ul></li>
<li>Transfer learning attempts to apply concepts learned in other problems to
bias your search.</li>
</ul>
</div></li></ol>
</div>
</div>

<div id="outline-container-orgheadline68" class="outline-3">
<h3 id="orgheadline68"><span class="section-number-3">9.2</span> When to use ML?</h3>
<div class="outline-text-3" id="text-9-2">
<ul class="org-ul">
<li>Shouldn't use ML to recognize geometric shapes.</li>
<li>In general, you don't need to learn if you have these things:
<ul class="org-ul">
<li>The concept is already accurately known.</li>
<li>It can be easily (and compactly) described</li>
<li>Unlikely to change</li>
</ul></li>
<li>Learning is not free, requires computation and storage, and real world
effort in labeling, etc.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline72" class="outline-3">
<h3 id="orgheadline72"><span class="section-number-3">9.3</span> Example Representations</h3>
<div class="outline-text-3" id="text-9-3">
<ul class="org-ul">
<li>Internal representation of examples effects how you learn.</li>
<li>EG: When you recognize objects, you don't do it at the level of signals on
your optic nerve.  You do it at the level of smaller parts that you've
learned.  A chair has four legs, a flat surface, and usually a back.</li>
<li>In the same way, pixels aren't useful in object recognition.</li>
<li>This is an open area of research: we don't always know the best
representation of examples.</li>
</ul>
</div>

<div id="outline-container-orgheadline69" class="outline-4">
<h4 id="orgheadline69"><span class="section-number-4">9.3.1</span> Feature Vector Representation</h4>
<div class="outline-text-4" id="text-9-3-1">
<ul class="org-ul">
<li>Examples are vectors of values for a set of attributes.</li>
<li><p>
Can be an n-by-m matrix
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Attr 1</td>
<td class="org-left">Attr 2</td>
<td class="org-left">Attr 3</td>
</tr>

<tr>
<td class="org-left">EG 1</td>
<td class="org-left">v<sub>11</sub></td>
<td class="org-left">v<sub>12</sub></td>
<td class="org-left">v<sub>13</sub></td>
</tr>

<tr>
<td class="org-left">EG 2</td>
<td class="org-left">V<sub>21</sub></td>
<td class="org-left">V<sub>22</sub></td>
<td class="org-left">v<sub>23</sub></td>
</tr>

<tr>
<td class="org-left">EG 3</td>
<td class="org-left">v<sub>31</sub></td>
<td class="org-left">v<sub>32</sub></td>
<td class="org-left">v<sub>33</sub></td>
</tr>
</tbody>
</table></li>

<li>This is also called "propositional representation", because each example
can be a logical conjunction.</li>
<li>Can represent all the examples as logic formula.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline70" class="outline-4">
<h4 id="orgheadline70"><span class="section-number-4">9.3.2</span> Relational Representation</h4>
<div class="outline-text-4" id="text-9-3-2">
<ul class="org-ul">
<li>Can use first order logic.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline71" class="outline-4">
<h4 id="orgheadline71"><span class="section-number-4">9.3.3</span> Multiple Instance Representation</h4>
<div class="outline-text-4" id="text-9-3-3">
<ul class="org-ul">
<li>Examples are represented by arbitrary sized sets of attribute-value pairs.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline90" class="outline-2">
<h2 id="orgheadline90"><span class="section-number-2">10</span> 2015-08-27 Thursday</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-orgheadline88" class="outline-3">
<h3 id="orgheadline88"><span class="section-number-3">10.1</span> Optimization</h3>
<div class="outline-text-3" id="text-10-1">
</div><div id="outline-container-orgheadline74" class="outline-4">
<h4 id="orgheadline74"><span class="section-number-4">10.1.1</span> What is it?</h4>
<div class="outline-text-4" id="text-10-1-1">
<p>
Find the extreme points of an objective function.
</p>
</div>
</div>
