eecs440.html

<div id="outline-container-orgheadline75" class="outline-4">
<h4 id="orgheadline75"><span class="section-number-4">10.1.2</span> Types of Optimization Problems</h4>
<div class="outline-text-4" id="text-10-1-2">
<ul class="org-ul">
<li>Discrete vs Continuous - objective function is defined on discrete or
continuous space.</li>
<li>Unconstrained vs constrained - whether there are additional constraints
defining the feasible region.</li>
<li>In this class, we are interested in continuous problems, constrained and
unconstrained.  We use tools from calculus and linear algebra.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline76" class="outline-4">
<h4 id="orgheadline76"><span class="section-number-4">10.1.3</span> Unconstrained Optimization</h4>
<div class="outline-text-4" id="text-10-1-3">
<ul class="org-ul">
<li>Function of one variable, eg minimum of x<sup>2</sup>.  Typical method for solving
this is to compute first and second derivative, find zeros of first
derivative where second derivative is positive.</li>
<li>Fuctions of two variables, you find the same things, but in matrix form:
<ul class="org-ul">
<li>Jacobian \(J = (\frac{\delta{}f}{\delta{}x_i}) = 0\)</li>
<li>Hessian \(H = [\frac{\delta^{2}f}{\delta{}x_{i}\delta{}x_j}] > 0\) must be
positive definite.</li>
</ul></li>
<li>Can't always do this, due to computational constrains, and due to weird or
unknown function.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline77" class="outline-4">
<h4 id="orgheadline77"><span class="section-number-4">10.1.4</span> Gradient Ascent</h4>
<div class="outline-text-4" id="text-10-1-4">
<p>
A way of maximizing/minimizing a function.  From your current position
\(\vec{x}\), go in the direction that maximizes the increase.
</p>

<p>
\(\vec{x}_{new} = \vec{x}_{old} - \alpha \Delta f_{\vec{x}_old}(\vec{x})\)
</p>

<p>
Here, &alpha; is the step size, and &Delta; f is the function gradient
evaluated at x<sub>old</sub>.
</p>

<p>
Downside of this is that the convergence rate is not very good.  Also, this
procedure assumes linearity, where a quadratic function may be a better
approximation.
</p>
</div>
</div>

<div id="outline-container-orgheadline78" class="outline-4">
<h4 id="orgheadline78"><span class="section-number-4">10.1.5</span> Newton-Raphson Method</h4>
<div class="outline-text-4" id="text-10-1-5">
<p>
In this, we use a quadratic approximation of f.  Then, instead of taking a
linear step, we take a "Newton step".
</p>

<p>
\(f(\vec{x}_{old} + u) = f(\vec{x}_{old}) + u^T \Delta f_{\vec{x}_{old}}(\vec{x}) + \frac{1}{2} u^T \Delta^2f_{\vec{x}_{old}}(\vec{x})u = g(u)\)
</p>

<p>
More math, see slides.
</p>

<p>
Properties:
</p>
<ul class="org-ul">
<li>Fast convergence close to solution.</li>
<li>Not guaranteed to converge if started far from solution, may cycle or
diverge in this case.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline79" class="outline-4">
<h4 id="orgheadline79"><span class="section-number-4">10.1.6</span> Quasi-Newton Methods</h4>
<div class="outline-text-4" id="text-10-1-6">
<ul class="org-ul">
<li>Often, constructing the Hessian for a multivariate function is
computationally difficult, because it takes O(n<sup>2</sup>) space and time and has
to be done over and over.</li>
<li>So, a number of methods exist that approximate the Hessian by using the
Jacobian at nearby points.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline80" class="outline-4">
<h4 id="orgheadline80"><span class="section-number-4">10.1.7</span> Local and Global Optima</h4>
<div class="outline-text-4" id="text-10-1-7">
<ul class="org-ul">
<li>A <b>global minimum</b> for a function is a point x where f(x) &le; f(x+u) for
all u.</li>
<li>A <b>local minimum</b> is an x where f(x) &le; f(x+u) for all |u|&lt;&epsilon;, for
some positive &epsilon;.</li>
<li>Every global minimum is a local min, but not the other way around.</li>
<li>There is no algorithm that is guaranteed to find the global maximum of an
arbitrary function.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline81" class="outline-4">
<h4 id="orgheadline81"><span class="section-number-4">10.1.8</span> Convex Sets</h4>
<div class="outline-text-4" id="text-10-1-8">
<p>
Take two points x<sub>1</sub> and x<sub>2</sub>.  A point on the line segment between them is
defined by &lambda; x<sub>1</sub> + (1-&lambda;) x<sub>2</sub>, for 0 &le; &lambda; &le; 1.
</p>

<p>
A Convex Set is a set of points such that for any two points in the set,
&lambda; x<sub>1</sub> + (1-&lambda;) x<sub>2</sub> is also in the set (for 0 &le; &lambda; &le;
1).  Basically, you can visualize these sets on the plane as "shapes that
don't have holes in them".
</p>
</div>
</div>

<div id="outline-container-orgheadline82" class="outline-4">
<h4 id="orgheadline82"><span class="section-number-4">10.1.9</span> Convex Functions</h4>
<div class="outline-text-4" id="text-10-1-9">
<p>
If you look at all the points that are "above" a function - {(x,y)|y &ge;
f(x)}, if that set is convex, then f is a convex function.
</p>

<p>
JENSEN'S INEQUALITY (yaaaaaaas)!
</p>

<p>
f(&lambda; x<sub>1</sub> + (1-&lambda;) x<sub>2</sub>) &le; &lambda; f(x<sub>1</sub>) + (1-&lambda;) f(x<sub>2</sub>)
</p>

<p>
Jensen's inequality seems to apply for any convex function.  It just says
that the points on the segment between f(x<sub>1</sub>) and f(x<sub>2</sub>) have to be above
the the function itself.  Pretty cool.
</p>

<p>
For a convex function, every local optimum is also a global optimum!  That's
a pretty nice property to have.
</p>
</div>
</div>

<div id="outline-container-orgheadline83" class="outline-4">
<h4 id="orgheadline83"><span class="section-number-4">10.1.10</span> Constrained Optimization</h4>
<div class="outline-text-4" id="text-10-1-10">
<ul class="org-ul">
<li>Minimize a function of x such that some constraints on x are satisfied.
The constraints define a feasible region on of in which the solution must
lie.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline84" class="outline-4">
<h4 id="orgheadline84"><span class="section-number-4">10.1.11</span> Linear Programming</h4>
<div class="outline-text-4" id="text-10-1-11">
<p>
Linear Programming is a <b>special case</b> of <b>constrained optimization</b>, in
which both the objective function and the constraints are linear!
Typically, we write all the constraints and objective function as functions
of matrices and vectors, for compactness.
</p>

<p>
When you apply all these linear constraints, you have a feasible region that
is a "polyhedron" (because it is bounded by a bunch of "hyperplanes").  It's
possible that one side of the feasible region is open, (so not completely
bounded).
</p>

<p>
If you have a linear objective function, you can say for certain that an
optimal point is on one of the vertices.
</p>
</div>
</div>

<div id="outline-container-orgheadline85" class="outline-4">
<h4 id="orgheadline85"><span class="section-number-4">10.1.12</span> Simplex Algorithm</h4>
<div class="outline-text-4" id="text-10-1-12">
<ul class="org-ul">
<li>Around the polyhedron we go.</li>
<li>From any feasible vertex, walk along the edges of the polyhedron,
following the vertices.</li>
<li>Once you are at a vertex where the neighboring vertices have higher f
values, stop.</li>
<li>You've found a local optimum, which happens to be a global optimum since
the linear function is convex.</li>
</ul>

<p>
Properties of this algorithm:
</p>

<ul class="org-ul">
<li>Very simple, and easy to implement, and works well in practice.</li>
<li>It works by traversing vertices, and there may be exponentially many
vertices for n constraints.  So, in the worst case, runtime is
exponential.
<ul class="org-ul">
<li>Average case under various distributions has been shown to be
polynomial, which is useful.</li>
</ul></li>
<li>Other algorithms exist, such as "interior point methods", which have
polynomial bounds*</li>
</ul>
</div>
</div>
