eecs440.org
*** Duality in Linear Programming

    From any "primal" LP, we can derive a "dual" LP.  Say we have a primal LP:

    - min_x c^T x, such that
    - A x \geq b
    - x \geq 0

    We could create a dual like this:

    - max_u b^T u, such that
    - A^T u \leq c
    - u \geq 0

    The nice properties of this are:

    - The primal has a solution iff the dual has a solution.
    - Further, the dual LP is a lower bound on the primal LP.
      - That is, if we pick any feasible x and any feasible u, we always havve
        c^T x \geq b^T u.
    - From the relationship between primal and dual LPs, we can derive a set of
      conditions that characterize the solutions for a primal/dual pair, called
      the Karush-Kuhn-Tucker conditions.
    - Essentially, the conditions are that at the optimal solution, x and u are
      feasible and the objective functions c^T x and b^T u are equal (and some
      other stuff).
    - Soumya says if this doesn't make sense now, that's ok.  Which is good,
      because he lost me at the dual being a lower bound on the primal.

*** Summary of Optimization

    - Types of optimization problems.
    - Unconstrained optimization - gradient ascent/descent, Newton Raphson
      methods.
    - Convex sets and functions
    - Constrained optimization:
      - Linear programming
      - Simplex method
      - Duality
      - KKT conditions

** The Simplex Algorithm

   He says we should know how it works.

   Let us consider the following linear program:

   - minimize (with respect to x_1, x_2) f(x) = 3x_1 - 6x_2, such that
   - x_1 + 2x_2 \geq -1
   - 2x_1 + x_2 \geq 0
   - -x_2 + x_1 \geq -1
   - -4x_2 + x_1 \geq -15
   - -4x_1 + x_2 \geq -23
   - x1, x_2 \geq 0

   Steps:
   1. Standardize so everything is in [variables] \geq [constant] form.
   2. Introduce "slack variables".  Essentially, these are the gap in the
      conditions.  These have to be greater than or equal to 0:
      1. x_3 = x_1 + 2x_2 + 1
      2. x_4 = 2x_1 + x_2
      3. x_5 = -x2 + x_1 + 1
      4. x_6 = -4x_2 + x_1 + 15
      5. x_7 = -4x_1 + x_2 + 23
   3. We can put this stuff into tableu form:

      |     | x_1 | x_2 |    |
      | x_3 |   1 |   2 |  1 |
      | x_4 |   2 |   1 |  0 |
      | x_5 |   1 |  -1 |  1 |
      | x_6 |   1 |  -4 | 13 |
      | x_7 |  -4 |   1 | 23 |
      | 2   |   3 |  -6 |  0 |

   4. Assume that zero is feasible.  Pick the variable that will decrease the
      objective function (the most?), and change it accordingly.  In this case,
      we choose x_2.  Then, we write out the constraints, holding x_1 to be 0.
      We find the smallest positive constraint value for x_2, and choose that.
      Whatever variable caused that constraint, we swap it with x_2, and make a
      new tableau.

      In this case, x_5 is the blocking constraint, so we pick it.

      |     | x_1 | x_5 |  1 |
      | x_3 |   3 |  -2 |  3 |
      | x_4 |   3 |  -1 |  1 |
      | x_2 |   1 |  -1 |  1 |
      | x_6 |  -3 |   4 |  9 |
      | x_7 |  -3 |   1 | 24 |
      | z   |  -3 |   6 | -6 |

   5. The value of the function is now -6.  We can see that the right variable
      to decrease now is x_1.  So, we do the constraints again.  Here, the
      blocking constraint is x_6, so then we get this tableau:

      |     |  x_6 | x_5 |   1 |
      | x_3 |   -1 |   2 |  12 |
      | x_4 |   -1 |   3 |  10 |
      | x_2 |  1/3 | 1/3 |   4 |
      | x_1 | -1/3 | 1/3 |   3 |
      | x_7 |    1 |  -5 |  15 |
      | z   |    2 |   1 | -15 |

      The stopping condition is when both variables on top of the columns have
      coefficients that are positive, so you can't improve the function value.

   If you have more than one variable that will decrease the function, you can
   choose any variable to decrease, and you will always get to the correct
   solution.  However, some choices will be faster than others.
