eecs440.html

<div id="outline-container-orgheadline86" class="outline-4">
<h4 id="orgheadline86"><span class="section-number-4">10.1.13</span> Duality in Linear Programming</h4>
<div class="outline-text-4" id="text-10-1-13">
<p>
From any "primal" LP, we can derive a "dual" LP.  Say we have a primal LP:
</p>

<ul class="org-ul">
<li>min<sub>x</sub> c<sup>T</sup> x, such that</li>
<li>A x &ge; b</li>
<li>x &ge; 0</li>
</ul>

<p>
We could create a dual like this:
</p>

<ul class="org-ul">
<li>max<sub>u</sub> b<sup>T</sup> u, such that</li>
<li>A<sup>T</sup> u &le; c</li>
<li>u &ge; 0</li>
</ul>

<p>
The nice properties of this are:
</p>

<ul class="org-ul">
<li>The primal has a solution iff the dual has a solution.</li>
<li>Further, the dual LP is a lower bound on the primal LP.
<ul class="org-ul">
<li>That is, if we pick any feasible x and any feasible u, we always havve
c<sup>T</sup> x &ge; b<sup>T</sup> u.</li>
</ul></li>
<li>From the relationship between primal and dual LPs, we can derive a set of
conditions that characterize the solutions for a primal/dual pair, called
the Karush-Kuhn-Tucker conditions.</li>
<li>Essentially, the conditions are that at the optimal solution, x and u are
feasible and the objective functions c<sup>T</sup> x and b<sup>T</sup> u are equal (and some
other stuff).</li>
<li>Soumya says if this doesn't make sense now, that's ok.  Which is good,
because he lost me at the dual being a lower bound on the primal.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline87" class="outline-4">
<h4 id="orgheadline87"><span class="section-number-4">10.1.14</span> Summary of Optimization</h4>
<div class="outline-text-4" id="text-10-1-14">
<ul class="org-ul">
<li>Types of optimization problems.</li>
<li>Unconstrained optimization - gradient ascent/descent, Newton Raphson
methods.</li>
<li>Convex sets and functions</li>
<li>Constrained optimization:
<ul class="org-ul">
<li>Linear programming</li>
<li>Simplex method</li>
<li>Duality</li>
<li>KKT conditions</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline89" class="outline-3">
<h3 id="orgheadline89"><span class="section-number-3">10.2</span> The Simplex Algorithm</h3>
<div class="outline-text-3" id="text-10-2">
<p>
He says we should know how it works.
</p>

<p>
Let us consider the following linear program:
</p>

<ul class="org-ul">
<li>minimize (with respect to x<sub>1</sub>, x<sub>2</sub>) f(x) = 3x<sub>1</sub> - 6x<sub>2</sub>, such that</li>
<li>x<sub>1</sub> + 2x<sub>2</sub> &ge; -1</li>
<li>2x<sub>1</sub> + x<sub>2</sub> &ge; 0</li>
<li>-x<sub>2</sub> + x<sub>1</sub> &ge; -1</li>
<li>-4x<sub>2</sub> + x<sub>1</sub> &ge; -15</li>
<li>-4x<sub>1</sub> + x<sub>2</sub> &ge; -23</li>
<li>x1, x<sub>2</sub> &ge; 0</li>
</ul>

<p>
Steps:
</p>
<ol class="org-ol">
<li>Standardize so everything is in [variables] &ge; [constant] form.</li>
<li>Introduce "slack variables".  Essentially, these are the gap in the
conditions.  These have to be greater than or equal to 0:
<ol class="org-ol">
<li>x<sub>3</sub> = x<sub>1</sub> + 2x<sub>2</sub> + 1</li>
<li>x<sub>4</sub> = 2x<sub>1</sub> + x<sub>2</sub></li>
<li>x<sub>5</sub> = -x2 + x<sub>1</sub> + 1</li>
<li>x<sub>6</sub> = -4x<sub>2</sub> + x<sub>1</sub> + 15</li>
<li>x<sub>7</sub> = -4x<sub>1</sub> + x<sub>2</sub> + 23</li>
</ol></li>
<li><p>
We can put this stuff into tableu form:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">x<sub>1</sub></td>
<td class="org-right">x<sub>2</sub></td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">x<sub>3</sub></td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">x<sub>4</sub></td>
<td class="org-right">2</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">x<sub>5</sub></td>
<td class="org-right">1</td>
<td class="org-right">-1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">x<sub>6</sub></td>
<td class="org-right">1</td>
<td class="org-right">-4</td>
<td class="org-right">13</td>
</tr>

<tr>
<td class="org-left">x<sub>7</sub></td>
<td class="org-right">-4</td>
<td class="org-right">1</td>
<td class="org-right">23</td>
</tr>

<tr>
<td class="org-left">2</td>
<td class="org-right">3</td>
<td class="org-right">-6</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table></li>

<li><p>
Assume that zero is feasible.  Pick the variable that will decrease the
objective function (the most?), and change it accordingly.  In this case,
we choose x<sub>2</sub>.  Then, we write out the constraints, holding x<sub>1</sub> to be 0.
We find the smallest positive constraint value for x<sub>2</sub>, and choose that.
Whatever variable caused that constraint, we swap it with x<sub>2</sub>, and make a
new tableau.
</p>

<p>
In this case, x<sub>5</sub> is the blocking constraint, so we pick it.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">x<sub>1</sub></td>
<td class="org-right">x<sub>5</sub></td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">x<sub>3</sub></td>
<td class="org-right">3</td>
<td class="org-right">-2</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">x<sub>4</sub></td>
<td class="org-right">3</td>
<td class="org-right">-1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">x<sub>2</sub></td>
<td class="org-right">1</td>
<td class="org-right">-1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">x<sub>6</sub></td>
<td class="org-right">-3</td>
<td class="org-right">4</td>
<td class="org-right">9</td>
</tr>

<tr>
<td class="org-left">x<sub>7</sub></td>
<td class="org-right">-3</td>
<td class="org-right">1</td>
<td class="org-right">24</td>
</tr>

<tr>
<td class="org-left">z</td>
<td class="org-right">-3</td>
<td class="org-right">6</td>
<td class="org-right">-6</td>
</tr>
</tbody>
</table></li>

<li><p>
The value of the function is now -6.  We can see that the right variable
to decrease now is x<sub>1</sub>.  So, we do the constraints again.  Here, the
blocking constraint is x<sub>6</sub>, so then we get this tableau:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">x<sub>6</sub></td>
<td class="org-right">x<sub>5</sub></td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">x<sub>3</sub></td>
<td class="org-right">-1</td>
<td class="org-right">2</td>
<td class="org-right">12</td>
</tr>

<tr>
<td class="org-left">x<sub>4</sub></td>
<td class="org-right">-1</td>
<td class="org-right">3</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-left">x<sub>2</sub></td>
<td class="org-right">1/3</td>
<td class="org-right">1/3</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">x<sub>1</sub></td>
<td class="org-right">-1/3</td>
<td class="org-right">1/3</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">x<sub>7</sub></td>
<td class="org-right">1</td>
<td class="org-right">-5</td>
<td class="org-right">15</td>
</tr>

<tr>
<td class="org-left">z</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
<td class="org-right">-15</td>
</tr>
</tbody>
</table>

<p>
The stopping condition is when both variables on top of the columns have
coefficients that are positive, so you can't improve the function value.
</p></li>
</ol>

<p>
If you have more than one variable that will decrease the function, you can
choose any variable to decrease, and you will always get to the correct
solution.  However, some choices will be faster than others.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Stephen Brennan</p>
<p class="date">Created: 2015-10-08 Thu 15:09</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
